lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
/* CUDA runner for FAIR's SAM 3D Objects — Phase 0 scaffold.
 *
 * What's wired right now:
 *   - cuew runtime + NVRTC compile bring-up (sentinel kernel).
 *   - Per-module safetensors directory resolution (explicit override or
 *     pipeline_yaml sibling fallback).
 *   - Public API stubs: every cuda_sam3d_run_* and cuda_sam3d_get_* is
 *     callable; each returns CUDA_SAM3D_E_NOT_IMPLEMENTED until its
 *     stage lands.
 *   - Debug overrides hold pytorch ref tensors on host; later stages
 *     consume them once the corresponding kernels go live.
 *
 * Subsequent phases bring in real kernels in the order:
 *   1. DINOv2-L/14+reg encoder      (mirror cuda/sam3d_body's DINOv3 path)
 *   2. CondEmbedderFuser            (Llama SwiGLU + concat)
 *   3. SS Flow DiT (shortcut ODE)   (mirror cuda/trellis2's DiT)
 *   4. SS-VAE 3D-conv decoder
 *   5. SLAT Flow DiT (shift-window)
 *   6. SLAT GS decoder + PLY emit
 *
 * Reference numerics live in /tmp/sam3d_ref/ (from
 * ref/sam3d/gen_image_ref.py); each stage gets a verify_*.c that diffs
 * against the same dumps the CPU runner uses.
 */

#include "cuda_sam3d_runner.h"
#include "../cuew.h"
#define CUDA_RUNNER_COMMON_IMPLEMENTATION
#include "../cuda_runner_common.h"
#include "../cuda_hip_compat.h"
#include "cuda_sam3d_kernels.h"

#define SAFETENSORS_IMPLEMENTATION
#include "../../common/safetensors.h"

#define CUDA_SAM3D_DINOV2_GPU_IMPLEMENTATION
#include "cuda_sam3d_dinov2_gpu.h"
#include "cuda_sam3d_dinov2_forward.h"
#define CUDA_SAM3D_PPE_GPU_IMPLEMENTATION
#include "cuda_sam3d_ppe_gpu.h"
#include "cuda_sam3d_ppe_forward.h"
#define CUDA_SAM3D_FUSER_GPU_IMPLEMENTATION
#include "cuda_sam3d_fuser_gpu.h"
#include "cuda_sam3d_fuser_forward.h"
#define CUDA_SAM3D_SSDIT_GPU_IMPLEMENTATION
#include "cuda_sam3d_ssdit_gpu.h"
#undef  CUDA_SAM3D_SSDIT_GPU_IMPLEMENTATION
#define CUDA_SAM3D_SSDIT_FORWARD_IMPLEMENTATION
#include "cuda_sam3d_ssdit_forward.h"
#undef  CUDA_SAM3D_SSDIT_FORWARD_IMPLEMENTATION
#define CUDA_SAM3D_SSDIT_OUTER_IMPLEMENTATION
#include "cuda_sam3d_ssdit_outer.h"
#undef  CUDA_SAM3D_SSDIT_OUTER_IMPLEMENTATION
#define CUDA_SAM3D_SS_DECODER_GPU_IMPLEMENTATION
#include "cuda_sam3d_ss_decoder_gpu.h"
#undef  CUDA_SAM3D_SS_DECODER_GPU_IMPLEMENTATION
#define CUDA_SAM3D_SS_DECODER_FORWARD_IMPLEMENTATION
#include "cuda_sam3d_ss_decoder_forward.h"
#undef  CUDA_SAM3D_SS_DECODER_FORWARD_IMPLEMENTATION
#define CUDA_SAM3D_SLAT_DIT_GPU_IMPLEMENTATION
#include "cuda_sam3d_slat_dit_gpu.h"
#undef  CUDA_SAM3D_SLAT_DIT_GPU_IMPLEMENTATION
#define CUDA_SAM3D_SLAT_DIT_FORWARD_IMPLEMENTATION
#include "cuda_sam3d_slat_dit_forward.h"
#undef  CUDA_SAM3D_SLAT_DIT_FORWARD_IMPLEMENTATION
#include "../../common/sam3d_shortcut_solver.h"
#include "../../common/sam3d_gs_decoder.h"
#include "sam3d_cpu.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#if defined(__AVX2__) && defined(__FMA__)
#include <immintrin.h>
#endif

#if defined(_OPENMP)
#include <omp.h>
#endif

/* ===== context state ===== */

typedef struct {
    int      n;
    int      c;
    float   *data;       /* host, malloc'd */
} cs3d_host_2d;

typedef struct {
    int      ndim;
    int      dims[4];
    float   *data;       /* host, malloc'd */
} cs3d_host_nd;

typedef struct {
    int      n, c;
    float   *feats;      /* host, malloc'd */
    int32_t *coords;     /* host, malloc'd */
} cs3d_host_slat;

typedef struct {
    CUdeviceptr norm1_w, norm1_b;
    CUdeviceptr conv1_w, conv1_b;
    CUdeviceptr conv2_w, conv2_b;
    CUdeviceptr emb_w, emb_b;
    CUdeviceptr skip_w, skip_b;
    int C_in, C_out;
    int updown, has_skip;
} cs3d_slat_io_block_gpu;

typedef struct {
    cs3d_slat_io_block_gpu input[2];
    cs3d_slat_io_block_gpu output[2];
    CUdeviceptr input_w, input_b;
    int input_in, input_out;
    CUdeviceptr out_w, out_b;
    int out_in, out_out;
    size_t total_bytes;
    int loaded;
} cs3d_slat_io_gpu;

typedef struct {
    hipFunction_t gemm, down, up, idx, ln, silu, conv, modln, resadd, concat;
    int loaded;
} cs3d_slat_io_fns;

typedef struct {
    CUdeviceptr d_in_coords, d_in_feats;
    CUdeviceptr d_coords, d_base;
    CUdeviceptr d_counts, d_outN;
    CUdeviceptr d_index;
    CUdeviceptr d_t_silu, d_emb;
    CUdeviceptr d_skip, d_h1, d_h2, d_h3, d_h4;
    size_t cap_in_coords, cap_in_feats;
    size_t cap_coords, cap_base;
    size_t cap_counts, cap_outN;
    size_t cap_index;
    size_t cap_t_silu, cap_emb;
    size_t cap_skip, cap_h1, cap_h2, cap_h3, cap_h4;
    int32_t *in_coords_cache, *coords_cache;
    size_t in_coords_cache_bytes, coords_cache_bytes;
} cs3d_slat_io_ws;

typedef struct {
    CUdeviceptr d_cur_coords, d_cur_feats;
    size_t cap_cur_coords, cap_cur_feats;
    CUdeviceptr d_skip_coords[2], d_skip_feats[2];
    size_t cap_skip_coords[2], cap_skip_feats[2];
    int skip_N[2], skip_C[2];
    CUdeviceptr d_cat_feats;
    size_t cap_cat_feats;
    float *t_emb;
    size_t cap_t_emb;
} cs3d_slat_ode_ws;

typedef struct {
    CUdeviceptr qkv_w, qkv_b;
    CUdeviceptr out_w, out_b;
    CUdeviceptr fc1_w, fc1_b;
    CUdeviceptr fc2_w, fc2_b;
} cs3d_gs_mlp_block_gpu;

typedef struct {
    CUdeviceptr input_w, input_b;
    CUdeviceptr out_w, out_b;
    cs3d_gs_mlp_block_gpu *mlp_blocks;
    int input_in, input_out;
    int out_in, out_out;
    int n_mlp_blocks, mlp_dim, mlp_hidden;
    size_t total_bytes;
    int loaded;
} cs3d_gs_head_gpu;

typedef struct { int64_t key; int idx; } cs3d_gs_win_kv;
typedef struct { int start; int len; } cs3d_gs_win_run;

typedef struct {
    CUdeviceptr d_coords, d_in, d_h, d_ln, d_out;
    CUdeviceptr d_qkv, d_fwd, d_attn, d_q, d_k, d_v, d_win, d_mlp;
    size_t cap_coords, cap_in, cap_h, cap_ln, cap_out;
    size_t cap_qkv, cap_fwd, cap_attn, cap_q, cap_k, cap_v, cap_win, cap_mlp;
} cs3d_gs_head_ws;

struct cuda_sam3d_ctx {
    cuda_sam3d_config cfg;
    cuda_sam3d_profile profile;
    char    *safetensors_dir_resolved;

    /* cuew + NVRTC. */
    int          device_id;
    int          sm;
    hipModule_t  mod;
    hipFunction_t fn_sentinel;
    int          compiled;

