lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    /* Inputs. */
    uint8_t *img_rgba;   int img_w, img_h;
    uint8_t *mask_u8;    int msk_w, msk_h;
    float   *pmap_f32;   int pmap_w, pmap_h;

    /* Debug-override host buffers (kept until consumed). */
    cs3d_host_2d   ovr_dinov2;
    cs3d_host_2d   ovr_cond;
    cs3d_host_nd   ovr_ss_latent;
    cs3d_host_nd   ovr_occupancy;
    cs3d_host_slat ovr_slat;

    /* Stage outputs (Phase 1a uses CPU fallback; host mirror kept so
     * verify_*.c can read back without a D2H round-trip until real
     * kernels land). */
    sam3d_cpu_dinov2 *cpu_dinov2;
    cs3d_host_2d      dinov2_tokens;
    CUdeviceptr       d_dinov2_tokens;   /* device mirror, [n_tok × dim] f32 */

    /* Phase 1b GPU DINOv2 forward — lazy-init on first run_dinov2 call. */
    cs3d_dinov2_gpu      gpu_dinov2;
    int                  gpu_dinov2_loaded;
    cs3d_dinov2_fns      gpu_dinov2_fns;
    cs3d_dinov2_block_ws gpu_dinov2_ws;
    int                  gpu_dinov2_ws_alloced;

    sam3d_cpu_fuser  *cpu_fuser;
    cs3d_host_2d      cond_tokens;
    CUdeviceptr       d_cond_tokens;     /* device mirror, [n_tok × D_out] f32 */

    /* Phase 2b.8d GPU PPE — lazy-init on first run_cond_fuser call. */
    cs3d_ppe_gpu      gpu_ppe;
    int               gpu_ppe_loaded;
    cs3d_ppe_fns      gpu_ppe_fns;
    cs3d_ppe_ws       gpu_ppe_ws;
    int               gpu_ppe_ws_alloced;

    /* Phase 2b.8e GPU fuser projection. */
    cs3d_fuser_gpu    gpu_fuser;
    int               gpu_fuser_loaded;
    cs3d_fuser_fns    gpu_fuser_fns;
    cs3d_fuser_ws     gpu_fuser_ws;
    int               gpu_fuser_ws_alloced;

    sam3d_cpu_ss_dit *cpu_ss_dit;
    cs3d_host_nd      ss_latent;         /* [8,16,16,16] f32 NCDHW */
    CUdeviceptr       d_ss_latent;       /* device mirror */

    /* Phase 2c.13 GPU SS Flow DiT — lazy-init on first ss_dit call. */
    cs3d_ssdit_gpu        gpu_ssdit;
    int                   gpu_ssdit_loaded;
    cs3d_ssdit_outer_fns  gpu_ssdit_fns;
    cs3d_ssdit_block_ws   gpu_ssdit_block_ws;
    cs3d_ssdit_outer_ws   gpu_ssdit_outer_ws;
    int                   gpu_ssdit_ws_alloced;
    int                   gpu_ssdit_ws_n_c;

    sam3d_cpu_ss_dec *cpu_ss_dec;
    cs3d_host_nd      occupancy;         /* [64,64,64] f32 logits */
    CUdeviceptr       d_occupancy;       /* device mirror */

    /* Phase 4b GPU SS-VAE decoder. */
    cs3d_ssdec_gpu    gpu_ssdec;
    int               gpu_ssdec_loaded;
    cs3d_ssdec_fns    gpu_ssdec_fns;
    cs3d_ssdec_ws     gpu_ssdec_ws;
    int               gpu_ssdec_ws_alloced;

    sam3d_cpu_slat_dit *cpu_slat_dit;
    cs3d_host_slat      slat_tokens;     /* (coords[N,4], feats[N,out_ch]) f32 */
    CUdeviceptr         d_slat_feats;    /* device mirror */
    CUdeviceptr         d_slat_coords;   /* device mirror */
    cs3d_slatdit_gpu       gpu_slatdit;
    int                    gpu_slatdit_loaded;
    cs3d_slatdit_fns       gpu_slatdit_fns;
    cs3d_slatdit_block_ws  gpu_slatdit_ws;
    int                    gpu_slatdit_ws_alloced;
    int                    gpu_slatdit_ws_n;
    int                    gpu_slatdit_ws_nc;
    CUdeviceptr            d_slat_hook_x;
    CUdeviceptr            d_slat_hook_coords;
    CUdeviceptr            d_slat_hook_t_emb;
    size_t                 slat_hook_x_bytes;
    size_t                 slat_hook_coords_bytes;
    size_t                 slat_hook_t_emb_bytes;
    int32_t               *slat_hook_coords_cache;
    size_t                 slat_hook_coords_cache_bytes;
    float                 *slat_hook_t_emb_cache;
    size_t                 slat_hook_t_emb_cache_bytes;
    const float           *slat_feat_cache_host;
    CUdeviceptr            slat_feat_cache_dev;
    int                    slat_feat_cache_n;
    int                    slat_feat_cache_c;
    const int32_t         *slat_coord_cache_host;
    CUdeviceptr            slat_coord_cache_dev;
    int                    slat_coord_cache_n;
    cs3d_slat_io_gpu       gpu_slat_io;
    cs3d_slat_io_fns       gpu_slat_io_fns;
    cs3d_slat_io_ws        gpu_slat_io_ws;
    cs3d_slat_ode_ws       gpu_slat_ode_ws;

    sam3d_cpu_gs_decoder *cpu_gs;
    cs3d_host_2d          gaussians;      /* [N*G, 17] PLY-layout f32 */
    CUdeviceptr           d_gaussians;    /* device mirror */
    cs3d_gs_head_gpu      gpu_gs_head;
    cs3d_gs_head_ws       gpu_gs_head_ws;
};

/* ===== tiny helpers ===== */

static char *cs3d_strdup(const char *s) {
    if (!s) return NULL;
    size_t n = strlen(s) + 1;
    char *r = (char *)malloc(n);
    if (r) memcpy(r, s, n);
    return r;
}

static double cs3d_time_ms(void)
{
    struct timespec ts;
    clock_gettime(CLOCK_MONOTONIC, &ts);
    return (double)ts.tv_sec * 1000.0 + (double)ts.tv_nsec / 1.0e6;
}

/* If cfg->safetensors_dir is non-NULL, return a strdup. Otherwise derive
 * from pipeline_yaml's parent directory by appending /../safetensors. */
static char *cs3d_resolve_safetensors_dir(const cuda_sam3d_config *cfg) {
    if (cfg->safetensors_dir && cfg->safetensors_dir[0])
        return cs3d_strdup(cfg->safetensors_dir);
    if (!cfg->pipeline_yaml || !cfg->pipeline_yaml[0]) return NULL;
    /* dirname(pipeline_yaml) + "/../safetensors" */
    const char *p = cfg->pipeline_yaml;
    const char *slash = strrchr(p, '/');
    size_t dir_len = slash ? (size_t)(slash - p) : 0;
    const char *suffix = "/../safetensors";
    size_t suf_len = strlen(suffix);
    char *r = (char *)malloc(dir_len + suf_len + 1);
    if (!r) return NULL;
    if (dir_len) memcpy(r, p, dir_len);
    memcpy(r + dir_len, suffix, suf_len + 1);
    return r;
}

static void cs3d_free_2d(cs3d_host_2d *t)   { free(t->data); t->data = NULL; t->n = t->c = 0; }
static void cs3d_free_nd(cs3d_host_nd *t)   { free(t->data); t->data = NULL; t->ndim = 0; }
static void cs3d_free_slat(cs3d_host_slat *t) {
    free(t->feats); free(t->coords);
    t->feats = NULL; t->coords = NULL; t->n = t->c = 0;
}

static void cs3d_slat_io_block_gpu_free(cs3d_slat_io_block_gpu *b)
{
    if (!b) return;
    if (b->norm1_w) cuMemFree(b->norm1_w);
    if (b->norm1_b) cuMemFree(b->norm1_b);
    if (b->conv1_w) cuMemFree(b->conv1_w);
    if (b->conv1_b) cuMemFree(b->conv1_b);
    if (b->conv2_w) cuMemFree(b->conv2_w);
    if (b->conv2_b) cuMemFree(b->conv2_b);
    if (b->emb_w)   cuMemFree(b->emb_w);
    if (b->emb_b)   cuMemFree(b->emb_b);
    if (b->skip_w)  cuMemFree(b->skip_w);
    if (b->skip_b)  cuMemFree(b->skip_b);
    memset(b, 0, sizeof(*b));
}

static void cs3d_slat_io_gpu_free(cs3d_slat_io_gpu *g)
{
    if (!g) return;
    for (int i = 0; i < 2; i++) {
        cs3d_slat_io_block_gpu_free(&g->input[i]);
        cs3d_slat_io_block_gpu_free(&g->output[i]);
    }
    if (g->input_w) cuMemFree(g->input_w);
    if (g->input_b) cuMemFree(g->input_b);
    if (g->out_w) cuMemFree(g->out_w);
    if (g->out_b) cuMemFree(g->out_b);
    memset(g, 0, sizeof(*g));
}

static void cs3d_slat_io_ws_free(cs3d_slat_io_ws *w)
{
    if (!w) return;
    if (w->d_in_coords) cuMemFree(w->d_in_coords);
    if (w->d_in_feats)  cuMemFree(w->d_in_feats);
    if (w->d_coords)    cuMemFree(w->d_coords);
    if (w->d_base)      cuMemFree(w->d_base);
    if (w->d_counts)    cuMemFree(w->d_counts);
    if (w->d_outN)      cuMemFree(w->d_outN);
    if (w->d_index)     cuMemFree(w->d_index);
    if (w->d_t_silu)    cuMemFree(w->d_t_silu);
    if (w->d_emb)       cuMemFree(w->d_emb);
    if (w->d_skip)      cuMemFree(w->d_skip);
    if (w->d_h1)        cuMemFree(w->d_h1);
    if (w->d_h2)        cuMemFree(w->d_h2);
    if (w->d_h3)        cuMemFree(w->d_h3);
    if (w->d_h4)        cuMemFree(w->d_h4);
    free(w->in_coords_cache);
    free(w->coords_cache);
    memset(w, 0, sizeof(*w));
}

static void cs3d_slat_ode_ws_free(cs3d_slat_ode_ws *w)
{
    if (!w) return;
    if (w->d_cur_coords) cuMemFree(w->d_cur_coords);
    if (w->d_cur_feats)  cuMemFree(w->d_cur_feats);
    for (int i = 0; i < 2; i++) {
        if (w->d_skip_coords[i]) cuMemFree(w->d_skip_coords[i]);
        if (w->d_skip_feats[i])  cuMemFree(w->d_skip_feats[i]);
    }
    if (w->d_cat_feats) cuMemFree(w->d_cat_feats);
    free(w->t_emb);
    memset(w, 0, sizeof(*w));
}

static void cs3d_gs_head_gpu_free(cs3d_gs_head_gpu *g)
{
    if (!g) return;
    if (g->input_w) cuMemFree(g->input_w);
    if (g->input_b) cuMemFree(g->input_b);
    if (g->out_w) cuMemFree(g->out_w);
    if (g->out_b) cuMemFree(g->out_b);
    if (g->mlp_blocks) {
        for (int i = 0; i < g->n_mlp_blocks; i++) {
            if (g->mlp_blocks[i].qkv_w) cuMemFree(g->mlp_blocks[i].qkv_w);
            if (g->mlp_blocks[i].qkv_b) cuMemFree(g->mlp_blocks[i].qkv_b);
            if (g->mlp_blocks[i].out_w) cuMemFree(g->mlp_blocks[i].out_w);
            if (g->mlp_blocks[i].out_b) cuMemFree(g->mlp_blocks[i].out_b);
            if (g->mlp_blocks[i].fc1_w) cuMemFree(g->mlp_blocks[i].fc1_w);
            if (g->mlp_blocks[i].fc1_b) cuMemFree(g->mlp_blocks[i].fc1_b);
            if (g->mlp_blocks[i].fc2_w) cuMemFree(g->mlp_blocks[i].fc2_w);
            if (g->mlp_blocks[i].fc2_b) cuMemFree(g->mlp_blocks[i].fc2_b);
        }
        free(g->mlp_blocks);
    }
    memset(g, 0, sizeof(*g));
}

static void cs3d_gs_head_ws_free(cs3d_gs_head_ws *w)
{
    if (!w) return;
    if (w->d_coords) cuMemFree(w->d_coords);
    if (w->d_in)     cuMemFree(w->d_in);
    if (w->d_h)      cuMemFree(w->d_h);
    if (w->d_ln)     cuMemFree(w->d_ln);
    if (w->d_out)    cuMemFree(w->d_out);
    if (w->d_qkv)    cuMemFree(w->d_qkv);
    if (w->d_fwd)    cuMemFree(w->d_fwd);
    if (w->d_attn)   cuMemFree(w->d_attn);
    if (w->d_q)      cuMemFree(w->d_q);
    if (w->d_k)      cuMemFree(w->d_k);
    if (w->d_v)      cuMemFree(w->d_v);
    if (w->d_win)    cuMemFree(w->d_win);
    if (w->d_mlp)    cuMemFree(w->d_mlp);
    memset(w, 0, sizeof(*w));
}

/* ===== public API ===== */

cuda_sam3d_ctx *cuda_sam3d_create(const cuda_sam3d_config *cfg)
{
    if (!cfg) return NULL;
    double t0 = cs3d_time_ms();

    cuda_sam3d_ctx *c = (cuda_sam3d_ctx *)calloc(1, sizeof(*c));
    if (!c) return NULL;
    c->cfg = *cfg;
    c->device_id = cfg->device_ordinal;
    if (c->cfg.ss_steps   <= 0) c->cfg.ss_steps   = 2;
    if (c->cfg.slat_steps <= 0) c->cfg.slat_steps = 12;
    if (c->cfg.cfg_scale  <= 0) c->cfg.cfg_scale  = 2.0f;

    c->safetensors_dir_resolved = cs3d_resolve_safetensors_dir(cfg);
    if (!c->safetensors_dir_resolved) {
        fprintf(stderr, "cuda_sam3d: need safetensors_dir or pipeline_yaml\n");
        free(c); return NULL;
    }

    if (cuewInit(CUEW_INIT_CUDA | CUEW_INIT_NVRTC) != CUEW_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: cuew init failed (no CUDA driver/runtime?)\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    CUresult init_rc = cuInit(0);
    if (init_rc != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: cuInit failed (%d)\n", (int)init_rc);
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    CUdevice dev;
    if (cuDeviceGet(&dev, c->device_id) != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: cuDeviceGet(%d) failed\n", c->device_id);
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    CUcontext cu_ctx;
    if (cuCtxCreate(&cu_ctx, 0, dev) != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: cuCtxCreate failed\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }

    c->sm = cu_compile_kernels(&c->mod, dev, cuda_sam3d_kernel_src,
                               "sam3d_kernels.cu", c->cfg.verbose,
                               "cuda_sam3d");
    if (c->sm < 0) {
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    if (cuModuleGetFunction(&c->fn_sentinel, c->mod, "sam3d_sentinel") != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: missing sam3d_sentinel\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    c->compiled = 1;
    c->profile.create_ms = cs3d_time_ms() - t0;
    c->profile.ss_steps = c->cfg.ss_steps;
    c->profile.slat_steps = c->cfg.slat_steps;

    if (c->cfg.verbose >= 1) {
        fprintf(stderr, "cuda_sam3d: created (sm_%d, safetensors_dir=%s, %.3f ms)\n",
                c->sm, c->safetensors_dir_resolved, c->profile.create_ms);
    }
    return c;
}

void cuda_sam3d_destroy(cuda_sam3d_ctx *ctx)
{
    if (!ctx) return;
    free(ctx->img_rgba); free(ctx->mask_u8); free(ctx->pmap_f32);
    cs3d_free_2d(&ctx->ovr_dinov2);
    cs3d_free_2d(&ctx->ovr_cond);
    cs3d_free_nd(&ctx->ovr_ss_latent);
    cs3d_free_nd(&ctx->ovr_occupancy);
    cs3d_free_slat(&ctx->ovr_slat);
    cs3d_free_2d(&ctx->dinov2_tokens);
    if (ctx->d_dinov2_tokens) cuMemFree(ctx->d_dinov2_tokens);
    if (ctx->cpu_dinov2) sam3d_cpu_dinov2_free(ctx->cpu_dinov2);
    if (ctx->gpu_dinov2_ws_alloced) cs3d_dinov2_block_ws_free(&ctx->gpu_dinov2_ws);
    if (ctx->gpu_dinov2_loaded) cs3d_dinov2_gpu_free(&ctx->gpu_dinov2);
    cs3d_free_2d(&ctx->cond_tokens);
    if (ctx->d_cond_tokens) cuMemFree(ctx->d_cond_tokens);
    if (ctx->gpu_ppe_ws_alloced)   cs3d_ppe_ws_free(&ctx->gpu_ppe_ws);
    if (ctx->gpu_ppe_loaded)       cs3d_ppe_gpu_free(&ctx->gpu_ppe);
    if (ctx->gpu_fuser_ws_alloced) cs3d_fuser_ws_free(&ctx->gpu_fuser_ws);
    if (ctx->gpu_fuser_loaded)     cs3d_fuser_gpu_free(&ctx->gpu_fuser);
    if (ctx->cpu_fuser) sam3d_cpu_fuser_free(ctx->cpu_fuser);
    cs3d_free_nd(&ctx->ss_latent);
    if (ctx->d_ss_latent) cuMemFree(ctx->d_ss_latent);
    if (ctx->gpu_ssdit_ws_alloced) {
        cs3d_ssdit_outer_ws_free(&ctx->gpu_ssdit_outer_ws);
        cs3d_ssdit_block_ws_free(&ctx->gpu_ssdit_block_ws);
    }
    cs3d_ssdit_fns_free(&ctx->gpu_ssdit_fns.block);
    if (ctx->gpu_ssdit_loaded) cs3d_ssdit_gpu_free(&ctx->gpu_ssdit);
    if (ctx->cpu_ss_dit) sam3d_cpu_ss_dit_free(ctx->cpu_ss_dit);
    cs3d_free_nd(&ctx->occupancy);
    if (ctx->d_occupancy) cuMemFree(ctx->d_occupancy);
    if (ctx->gpu_ssdec_ws_alloced) cs3d_ssdec_ws_free(&ctx->gpu_ssdec_ws);
    if (ctx->gpu_ssdec_loaded)     cs3d_ssdec_gpu_free(&ctx->gpu_ssdec);
    if (ctx->cpu_ss_dec) sam3d_cpu_ss_dec_free(ctx->cpu_ss_dec);
    cs3d_free_slat(&ctx->slat_tokens);
    if (ctx->d_slat_feats)  cuMemFree(ctx->d_slat_feats);
    if (ctx->d_slat_coords) cuMemFree(ctx->d_slat_coords);
    if (ctx->d_slat_hook_x)     cuMemFree(ctx->d_slat_hook_x);
    if (ctx->d_slat_hook_coords) cuMemFree(ctx->d_slat_hook_coords);
    if (ctx->d_slat_hook_t_emb) cuMemFree(ctx->d_slat_hook_t_emb);
    free(ctx->slat_hook_coords_cache);
    free(ctx->slat_hook_t_emb_cache);
    if (ctx->gpu_slatdit_ws_alloced) cs3d_slatdit_block_ws_free(&ctx->gpu_slatdit_ws);
    cs3d_slatdit_fns_free(&ctx->gpu_slatdit_fns);
    if (ctx->gpu_slatdit_loaded)     cs3d_slatdit_gpu_free(&ctx->gpu_slatdit);
    if (ctx->gpu_slat_io.loaded)     cs3d_slat_io_gpu_free(&ctx->gpu_slat_io);
    cs3d_slat_io_ws_free(&ctx->gpu_slat_io_ws);
    cs3d_slat_ode_ws_free(&ctx->gpu_slat_ode_ws);
    if (ctx->cpu_slat_dit) sam3d_cpu_slat_dit_free(ctx->cpu_slat_dit);
    cs3d_free_2d(&ctx->gaussians);
    if (ctx->d_gaussians) cuMemFree(ctx->d_gaussians);
    if (ctx->gpu_gs_head.loaded) cs3d_gs_head_gpu_free(&ctx->gpu_gs_head);
    cs3d_gs_head_ws_free(&ctx->gpu_gs_head_ws);
    if (ctx->cpu_gs) sam3d_cpu_gs_decoder_free(ctx->cpu_gs);
    if (ctx->compiled) cuModuleUnload(ctx->mod);
    free(ctx->safetensors_dir_resolved);
    free(ctx);
}

