lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
int cuda_sam3d_get_profile(cuda_sam3d_ctx *ctx,
                           cuda_sam3d_profile *out_profile)
{
    if (!ctx || !out_profile) return CUDA_SAM3D_E_INVAL;
    *out_profile = ctx->profile;
    return CUDA_SAM3D_E_OK;
}

/* ===== inputs ===== */

int cuda_sam3d_set_image_rgba(cuda_sam3d_ctx *ctx, const uint8_t *rgba,
                              int width, int height) {
    double t0 = cs3d_time_ms();
    if (!ctx || !rgba || width <= 0 || height <= 0) return CUDA_SAM3D_E_INVAL;
    free(ctx->img_rgba);
    size_t n = (size_t)width * height * 4;
    ctx->img_rgba = (uint8_t *)malloc(n);
    if (!ctx->img_rgba) return CUDA_SAM3D_E_LOAD;
    memcpy(ctx->img_rgba, rgba, n);
    ctx->img_w = width; ctx->img_h = height;
    ctx->profile.set_image_ms = cs3d_time_ms() - t0;
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_set_mask(cuda_sam3d_ctx *ctx, const uint8_t *mask,
                        int width, int height) {
    double t0 = cs3d_time_ms();
    if (!ctx || !mask || width <= 0 || height <= 0) return CUDA_SAM3D_E_INVAL;
    free(ctx->mask_u8);
    size_t n = (size_t)width * height;
    ctx->mask_u8 = (uint8_t *)malloc(n);
    if (!ctx->mask_u8) return CUDA_SAM3D_E_LOAD;
    memcpy(ctx->mask_u8, mask, n);
    ctx->msk_w = width; ctx->msk_h = height;
    ctx->profile.set_mask_ms = cs3d_time_ms() - t0;
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_set_pointmap(cuda_sam3d_ctx *ctx, const float *pmap,
                            int width, int height) {
    double t0 = cs3d_time_ms();
    if (!ctx || !pmap || width <= 0 || height <= 0) return CUDA_SAM3D_E_INVAL;
    free(ctx->pmap_f32);
    size_t n = (size_t)width * height * 3;
    ctx->pmap_f32 = (float *)malloc(n * sizeof(float));
    if (!ctx->pmap_f32) return CUDA_SAM3D_E_LOAD;
    memcpy(ctx->pmap_f32, pmap, n * sizeof(float));
    ctx->pmap_w = width; ctx->pmap_h = height;
    ctx->profile.set_pointmap_ms = cs3d_time_ms() - t0;
    return CUDA_SAM3D_E_OK;
}

/* ===== stage stubs ===== */

/* Adopt a freshly-computed [n × c] f32 token block as the dinov2
 * stage output. Frees any prior host/device buffers. Takes ownership
 * of `feats` (must be malloc'd). */
static int cs3d_adopt_dinov2_tokens(cuda_sam3d_ctx *ctx, float *feats,
                                    int n, int c)
{
    cs3d_free_2d(&ctx->dinov2_tokens);
    if (ctx->d_dinov2_tokens) {
        cuMemFree(ctx->d_dinov2_tokens);
        ctx->d_dinov2_tokens = 0;
    }
    if (!feats || n <= 0 || c <= 0) return CUDA_SAM3D_E_INVAL;

    size_t bytes = (size_t)n * c * sizeof(float);
    ctx->d_dinov2_tokens = cu_upload_raw(feats, bytes);
    if (!ctx->d_dinov2_tokens) { free(feats); return CUDA_SAM3D_E_LOAD; }
    ctx->dinov2_tokens.data = feats;
    ctx->dinov2_tokens.n    = n;
    ctx->dinov2_tokens.c    = c;
    return CUDA_SAM3D_E_OK;
}

/* Phase 1b.8: run one branch (image or mask) through the GPU forward.
 * chw_norm is [3, S, S] f32, normalized. Returns malloc'd [n_tok × dim]
 * with the n_register tokens removed (matching CPU numerics). */
static float *cs3d_gpu_dinov2_encode_branch(cuda_sam3d_ctx *ctx,
                                            const float *chw_norm)
{
    cs3d_dinov2_gpu *g = &ctx->gpu_dinov2;
    size_t n_img = (size_t)3 * g->image_size * g->image_size;
    size_t n_out = (size_t)g->n_tokens * g->dim;

    CUdeviceptr d_img = cu_upload_raw(chw_norm, n_img * sizeof(float));
    if (!d_img) return NULL;
    CUdeviceptr d_out = 0;
    if (cuMemAlloc(&d_out, n_out * sizeof(float)) != CUDA_SUCCESS) {
        cuMemFree(d_img); return NULL;
    }
    int rc = cs3d_dinov2_gpu_forward(&ctx->gpu_dinov2_fns, &ctx->gpu_dinov2_ws,
                                     g, d_img, d_out);
    cuMemFree(d_img);
    if (rc < 0) { cuMemFree(d_out); return NULL; }

    float *host = (float *)malloc(n_out * sizeof(float));
    if (!host) { cuMemFree(d_out); return NULL; }
    if (cuMemcpyDtoH(host, d_out, n_out * sizeof(float)) != CUDA_SUCCESS) {
        free(host); cuMemFree(d_out); return NULL;
    }
    cuMemFree(d_out);

    /* Drop register tokens in-place: keep [CLS] then patch tokens, skip
     * the n_register tokens between them. */
    int dim       = g->dim;
    int n_reg     = g->n_register;
    int keep_pat  = g->n_tokens - 1 - n_reg;
    if (n_reg > 0 && keep_pat > 0) {
        memmove(host + (size_t)dim,
                host + (size_t)(1 + n_reg) * dim,
                (size_t)keep_pat * dim * sizeof(float));
    }
    return host;
}

int cuda_sam3d_run_dinov2(cuda_sam3d_ctx *ctx) {
    double t0 = cs3d_time_ms();
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    if (!ctx->img_rgba) return CUDA_SAM3D_E_NO_INPUT;

    /* CPU model kept for preprocessing (image_mean/std + bilinear-resize
     * + ImageNet-normalize); the encode itself runs on the GPU. */
    if (!ctx->cpu_dinov2) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_dinov2.safetensors",
                 ctx->safetensors_dir_resolved);
        ctx->cpu_dinov2 = sam3d_cpu_dinov2_load(path);
        if (!ctx->cpu_dinov2) {
            fprintf(stderr, "cuda_sam3d: dinov2 load failed (%s)\n", path);
            return CUDA_SAM3D_E_LOAD;
        }
    }
    if (!ctx->gpu_dinov2_loaded) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_dinov2.safetensors",
                 ctx->safetensors_dir_resolved);
        if (cs3d_dinov2_gpu_load(&ctx->gpu_dinov2, path, ctx->cfg.verbose) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu dinov2 weight upload failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_dinov2_loaded = 1;
        if (cs3d_dinov2_fns_lookup(&ctx->gpu_dinov2_fns, ctx->mod) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu dinov2 fns lookup failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        if (cs3d_dinov2_block_ws_alloc(&ctx->gpu_dinov2_ws,
                                       ctx->gpu_dinov2.n_tokens,
                                       ctx->gpu_dinov2.dim,
                                       ctx->gpu_dinov2.ffn_hidden) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu dinov2 ws alloc failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_dinov2_ws_alloced = 1;
    }

