lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    /* Project each modality, writing into the right slice of d_cond.
     * idx_emb add is folded into the final w2 gemm via gemm_f32_bias. */
    CUdeviceptr pos_row = ctx->gpu_fuser.idx_emb_rows[SAM3D_FUSER_POS_FULL];
    {
        const cs3d_fuser_proj_w *p0 = &ctx->gpu_fuser.projs[SAM3D_FUSER_MOD_DINO_IMG];
        CUdeviceptr in_img = d_dino;
        CUdeviceptr out_img = d_cond + 0;
        if (cs3d_fuser_project_forward(&ctx->gpu_fuser_fns, &ctx->gpu_fuser_ws,
                                       p0, in_img, out_img, branch, pos_row, 1e-5f) < 0)
            goto fuser_fail;
    }
    {
        const cs3d_fuser_proj_w *p1 = &ctx->gpu_fuser.projs[SAM3D_FUSER_MOD_DINO_MSK];
        CUdeviceptr in_msk = d_dino + (size_t)branch * Di_dino * sizeof(float);
        CUdeviceptr out_msk = d_cond + (size_t)branch * Do * sizeof(float);
        if (cs3d_fuser_project_forward(&ctx->gpu_fuser_fns, &ctx->gpu_fuser_ws,
                                       p1, in_msk, out_msk, branch, pos_row, 1e-5f) < 0)
            goto fuser_fail;
    }
    if (have_ppe) {
        const cs3d_fuser_proj_w *p2 = &ctx->gpu_fuser.projs[SAM3D_FUSER_MOD_POINT];
        CUdeviceptr out_pt = d_cond + (size_t)2 * branch * Do * sizeof(float);
        if (cs3d_fuser_project_forward(&ctx->gpu_fuser_fns, &ctx->gpu_fuser_ws,
                                       p2, d_ppe, out_pt, Nwin, pos_row, 1e-5f) < 0)
            goto fuser_fail;
    }
    cuCtxSynchronize();

    /* D2H mirror so verify_*.c and downstream stages can read host. */
    float *feats = (float *)malloc((size_t)n_total * Do * sizeof(float));
    if (!feats) goto fuser_fail;
    cuMemcpyDtoH(feats, d_cond, (size_t)n_total * Do * sizeof(float));
    if (d_dino) cuMemFree(d_dino);
    if (d_ppe)  cuMemFree(d_ppe);

    (void)nthr;
    int rc = cs3d_adopt_cond_tokens_device(ctx, feats, n_total, Do, d_cond);
    d_cond = 0;
    ctx->profile.cond_fuser_ms = cs3d_time_ms() - t0;
    if (rc == CUDA_SAM3D_E_OK) ctx->profile.cond_tokens = n_total;
    return rc;

fuser_fail:
    if (d_dino) cuMemFree(d_dino);
    if (d_ppe)  cuMemFree(d_ppe);
    if (d_cond) cuMemFree(d_cond);
    fprintf(stderr, "cuda_sam3d: GPU fuser projection failed\n");
    if (ctx) ctx->profile.cond_fuser_ms = cs3d_time_ms() - t0;
    return CUDA_SAM3D_E_LOAD;
}
/* Active cond source: prefer override (verify_*.c injects ref data). */
static const cs3d_host_2d *cs3d_active_cond(const cuda_sam3d_ctx *ctx)
{
    return ctx->ovr_cond.data ? &ctx->ovr_cond : &ctx->cond_tokens;
}

static int cs3d_ensure_ss_dit(cuda_sam3d_ctx *ctx) {
    if (ctx->cpu_ss_dit) return CUDA_SAM3D_E_OK;
    ctx->cpu_ss_dit = sam3d_cpu_ss_dit_load(ctx->safetensors_dir_resolved);
    if (!ctx->cpu_ss_dit) {
        fprintf(stderr, "cuda_sam3d: ss_dit load failed (dir=%s)\n",
                ctx->safetensors_dir_resolved);
        return CUDA_SAM3D_E_LOAD;
    }
    return CUDA_SAM3D_E_OK;
}

static int cs3d_adopt_ss_latent(cuda_sam3d_ctx *ctx, float *data,
                                const int dims[4])
{
    cs3d_free_nd(&ctx->ss_latent);
    if (ctx->d_ss_latent) { cuMemFree(ctx->d_ss_latent); ctx->d_ss_latent = 0; }
    if (!data) return CUDA_SAM3D_E_INVAL;
    size_t numel = 1;
    for (int i = 0; i < 4; i++) {
        if (dims[i] <= 0) { free(data); return CUDA_SAM3D_E_INVAL; }
        ctx->ss_latent.dims[i] = dims[i];
        numel *= (size_t)dims[i];
    }
    ctx->ss_latent.ndim = 4;
    ctx->ss_latent.data = data;
    ctx->d_ss_latent = cu_upload_raw(data, numel * sizeof(float));
    if (!ctx->d_ss_latent) {
        cs3d_free_nd(&ctx->ss_latent);
        return CUDA_SAM3D_E_LOAD;
    }
    return CUDA_SAM3D_E_OK;
}

static int cs3d_ensure_ssdit_gpu(cuda_sam3d_ctx *ctx, int n_cond_min);

/* Match sam3d_cpu.c's xorshift64* + Box-Muller schedule byte-for-byte so
 * a fixed seed yields identical noise across CPU and GPU paths. */
static inline uint64_t cs3d_ode_rng_next(uint64_t *state) {
    uint64_t x = *state;
    x ^= x >> 12; x ^= x << 25; x ^= x >> 27;
    *state = x;
    return x * 0x2545F4914F6CDD1DULL;
}
static inline float cs3d_ode_rng_u01(uint64_t *state) {
    uint64_t r = cs3d_ode_rng_next(state) >> 11;
    return (float)((double)r * (1.0 / 9007199254740992.0));
}
static void cs3d_ode_fill_randn(float *buf, int n, uint64_t *state) {
    for (int i = 0; i < n; i += 2) {
        float u1 = cs3d_ode_rng_u01(state); if (u1 < 1e-7f) u1 = 1e-7f;
        float u2 = cs3d_ode_rng_u01(state);
        float r = sqrtf(-2.0f * logf(u1));
        float a = 6.2831853f * u2;
        buf[i] = r * cosf(a);
        if (i + 1 < n) buf[i + 1] = r * sinf(a);
    }
}

int cuda_sam3d_run_ss_dit(cuda_sam3d_ctx *ctx) {
    double t0 = cs3d_time_ms();
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_2d *cond = cs3d_active_cond(ctx);
    if (!cond->data) {
        fprintf(stderr, "cuda_sam3d: ss_dit needs cond tokens — "
                        "run cond_fuser (or override) first\n");
        return CUDA_SAM3D_E_NO_INPUT;
    }
    int rc = cs3d_ensure_ssdit_gpu(ctx, cond->n);
    if (rc != CUDA_SAM3D_E_OK) return rc;

    const sam3d_ss_flow_dit_model *m = sam3d_cpu_ss_dit_model(ctx->cpu_ss_dit);
    if (!m) return CUDA_SAM3D_E_LOAD;

    int steps = ctx->cfg.ss_steps > 0 ? ctx->cfg.ss_steps : 2;

    float *lat[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel_u[SAM3D_SS_DIT_N_LATENTS] = {0};
    int    nlat[SAM3D_SS_DIT_N_LATENTS] = {0};
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        nlat[i] = sam3d_cpu_ss_dit_lat_elts(i);
        lat[i] = (float *)malloc((size_t)nlat[i] * sizeof(float));
        vel[i] = (float *)malloc((size_t)nlat[i] * sizeof(float));
        vel_u[i] = (float *)malloc((size_t)nlat[i] * sizeof(float));
        if (!lat[i] || !vel[i] || !vel_u[i]) goto oom;
    }

    uint64_t rng = ctx->cfg.seed ? (uint64_t)ctx->cfg.seed
                                 : 0x9E3779B97F4A7C15ULL;
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
        cs3d_ode_fill_randn(lat[i], nlat[i], &rng);

    float *times = (float *)malloc((size_t)(steps + 1) * sizeof(float));
    if (!times) goto oom;
    /* Match upstream pointmap inference: no_shortcut=True, ss_rescale_t=3,
     * reversed_timestamp=False. The model still has a d-embedder, but
     * production inference passes d=0. */
    sam3d_shortcut_make_times(times, steps, 3.0f, /*reversed=*/0);
    float d = sam3d_shortcut_d(steps, /*no_shortcut=*/1);
    const float TIME_SCALE = m->time_scale;

