lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    /* One-shot cond HtoD upload — every step then sees it via the
     * outer workspace (NULL host pointer skips the per-step copy). */
    if (cs3d_ssdit_outer_upload_cond(&ctx->gpu_ssdit_outer_ws,
                                     cond->data, cond->n, m->dim) < 0) {
        free(times);
        fprintf(stderr, "cuda_sam3d: ss_dit cond upload failed\n");
        goto oom;
    }

    float *zero_cond = NULL;
    if (ctx->cfg.cfg_scale > 0.0f) {
        zero_cond = (float *)calloc((size_t)cond->n * cond->c, sizeof(float));
        if (!zero_cond) { free(times); goto oom; }
    }
    int cfg_steps = 0;

    for (int s = 0; s < steps; s++) {
        float t  = times[s];
        float dt = times[s + 1] - times[s];
        float ts = t * TIME_SCALE;
        if (cs3d_ssdit_outer_forward(&ctx->gpu_ssdit, &ctx->gpu_ssdit_fns,
                                     &ctx->gpu_ssdit_block_ws,
                                     &ctx->gpu_ssdit_outer_ws,
                                     (const float *const *)lat, vel,
                                     /*cond=*/NULL, cond->n,
                                     ts, d * TIME_SCALE) < 0) {
            free(times); free(zero_cond);
            fprintf(stderr, "cuda_sam3d: ss_dit GPU forward failed (step %d)\n", s);
            goto oom;
        }
        if (zero_cond && sam3d_shortcut_cfg_active(ts, 0.0f, 500.0f)) {
            if (cs3d_ssdit_outer_upload_cond(&ctx->gpu_ssdit_outer_ws,
                                             zero_cond, cond->n, m->dim) < 0 ||
                cs3d_ssdit_outer_forward(&ctx->gpu_ssdit, &ctx->gpu_ssdit_fns,
                                         &ctx->gpu_ssdit_block_ws,
                                         &ctx->gpu_ssdit_outer_ws,
                                         (const float *const *)lat, vel_u,
                                         /*cond=*/NULL, cond->n,
                                         ts, d * TIME_SCALE) < 0) {
                free(times); free(zero_cond);
                fprintf(stderr, "cuda_sam3d: ss_dit GPU uncond forward failed (step %d)\n", s);
                goto oom;
            }
            for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
                sam3d_shortcut_cfg_combine(vel[i], vel[i], vel_u[i],
                                           ctx->cfg.cfg_scale, nlat[i]);
            }
            cfg_steps++;
            if (s + 1 < steps &&
                cs3d_ssdit_outer_upload_cond(&ctx->gpu_ssdit_outer_ws,
                                             cond->data, cond->n, m->dim) < 0) {
                free(times); free(zero_cond);
                fprintf(stderr, "cuda_sam3d: ss_dit cond restore failed\n");
                goto oom;
            }
        }
        for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
            sam3d_shortcut_euler_step(lat[i], vel[i], dt, nlat[i]);
    }
    free(times); free(zero_cond);

    /* SHAPE → NCDHW [8, 16, 16, 16] from DiT layout [N=4096, C=8]. */
    const int dims[4] = {8, 16, 16, 16};
    size_t numel = 8 * 16 * 16 * 16;
    float *latent = (float *)malloc(numel * sizeof(float));
    if (!latent) goto oom;
    for (int n = 0; n < 4096; n++)
        for (int c = 0; c < 8; c++)
            latent[c * 4096 + n] = lat[SAM3D_SS_LAT_SHAPE][n * 8 + c];

    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        free(lat[i]); free(vel[i]); free(vel_u[i]);
    }
    if (ctx->cfg.verbose >= 1) {
        float mn = latent[0], mx = latent[0];
        double sum = 0.0;
        for (int i = 0; i < 8 * 4096; i++) {
            float v = latent[i];
            if (v < mn) mn = v;
            if (v > mx) mx = v;
            sum += v;
        }
        fprintf(stderr,
                "cuda_sam3d: ss_dit latent min=%.6g max=%.6g mean=%.6g d=%.3g rescale_t=3 reversed=0 cfg_steps=%d\n",
                mn, mx, sum / (8.0 * 4096.0), d, cfg_steps);
    }
    rc = cs3d_adopt_ss_latent(ctx, latent, dims);
    ctx->profile.ss_dit_ms = cs3d_time_ms() - t0;
    ctx->profile.ss_steps = steps;
    ctx->profile.cfg_steps = cfg_steps;
    return rc;

oom:
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        free(lat[i]); free(vel[i]); free(vel_u[i]);
    }
    if (ctx) ctx->profile.ss_dit_ms = cs3d_time_ms() - t0;
    return CUDA_SAM3D_E_LOAD;
}

/* Lazy-init GPU SS Flow DiT (weights upload + fns lookup + workspaces).
 * `n_cond_min` is the largest cond-token count we must support; the outer
 * workspace is grown on-demand if a later call exceeds the cap. */
static int cs3d_ensure_ssdit_gpu(cuda_sam3d_ctx *ctx, int n_cond_min)
{
    int rc = cs3d_ensure_ss_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    sam3d_ss_flow_dit_model *m = sam3d_cpu_ss_dit_model(ctx->cpu_ss_dit);
    if (!m) return CUDA_SAM3D_E_LOAD;

    if (!ctx->gpu_ssdit_loaded) {
        if (cs3d_ssdit_gpu_load(&ctx->gpu_ssdit, m, ctx->cfg.verbose) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_dit weight upload failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_ssdit_loaded = 1;
        if (cs3d_ssdit_outer_fns_lookup(&ctx->gpu_ssdit_fns, ctx->mod) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_dit fns lookup failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
    }

    if (ctx->gpu_ssdit_ws_alloced && n_cond_min > ctx->gpu_ssdit_ws_n_c) {
        cs3d_ssdit_outer_ws_free(&ctx->gpu_ssdit_outer_ws);
        cs3d_ssdit_block_ws_free(&ctx->gpu_ssdit_block_ws);
        ctx->gpu_ssdit_ws_alloced = 0;
    }
    if (!ctx->gpu_ssdit_ws_alloced) {
        const cs3d_ssdit_gpu *g = &ctx->gpu_ssdit;
        int N_s = g->latent[SAM3D_SS_LAT_SHAPE].token_len;
        int N_p = 0;
        for (int i = SAM3D_SS_LAT_6DROT; i <= SAM3D_SS_LAT_TRANSLATION_SCALE; i++)
            N_p += g->latent[i].token_len;
        if (cs3d_ssdit_block_ws_alloc(&ctx->gpu_ssdit_block_ws,
                                      N_s, N_p, n_cond_min,
                                      g->dim, g->mlp_hidden) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_dit block_ws alloc failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        if (cs3d_ssdit_outer_ws_alloc(&ctx->gpu_ssdit_outer_ws, g, n_cond_min) < 0) {
            cs3d_ssdit_block_ws_free(&ctx->gpu_ssdit_block_ws);
            fprintf(stderr, "cuda_sam3d: gpu ss_dit outer_ws alloc failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_ssdit_ws_alloced = 1;
        ctx->gpu_ssdit_ws_n_c = n_cond_min;
    }
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_debug_ss_dit_forward(cuda_sam3d_ctx *ctx,
                                    const float *const *latents_in,
                                    float *const *latents_out,
                                    const float *cond, int n_cond,
                                    float t, float d)
{
    if (!ctx || !latents_in || !latents_out || !cond || n_cond <= 0)
        return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_ssdit_gpu(ctx, n_cond);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    return cs3d_ssdit_outer_forward(&ctx->gpu_ssdit, &ctx->gpu_ssdit_fns,
                                    &ctx->gpu_ssdit_block_ws,
                                    &ctx->gpu_ssdit_outer_ws,
                                    latents_in, latents_out,
                                    cond, n_cond, t, d) == 0
           ? CUDA_SAM3D_E_OK : CUDA_SAM3D_E_LOAD;
}

