lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
int cuda_sam3d_ss_dit_info(cuda_sam3d_ctx *ctx,
                           int *out_n_blocks, int *out_dim,
                           int *out_cond_channels, int *out_is_shortcut)
{
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_ss_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    if (out_n_blocks)      *out_n_blocks      = sam3d_cpu_ss_dit_n_blocks     (ctx->cpu_ss_dit);
    if (out_dim)           *out_dim           = sam3d_cpu_ss_dit_dim          (ctx->cpu_ss_dit);
    if (out_cond_channels) *out_cond_channels = sam3d_cpu_ss_dit_cond_channels(ctx->cpu_ss_dit);
    if (out_is_shortcut)   *out_is_shortcut   = sam3d_cpu_ss_dit_is_shortcut  (ctx->cpu_ss_dit);
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_ss_dit_n_latents(void) { return sam3d_cpu_ss_dit_n_latents(); }
int cuda_sam3d_ss_dit_lat_elts(int i) { return sam3d_cpu_ss_dit_lat_elts(i); }

/* Active ss_latent source: prefer override. Returns NULL if neither is set. */
static const cs3d_host_nd *cs3d_active_ss_latent(const cuda_sam3d_ctx *ctx)
{
    return ctx->ovr_ss_latent.data ? &ctx->ovr_ss_latent : &ctx->ss_latent;
}

static int cs3d_adopt_occupancy_device(cuda_sam3d_ctx *ctx, float *data,
                                       const int dims[3],
                                       CUdeviceptr d_data)
{
    cs3d_free_nd(&ctx->occupancy);
    if (ctx->d_occupancy && ctx->d_occupancy != d_data)
        cuMemFree(ctx->d_occupancy);
    ctx->d_occupancy = 0;
    if (!data || !d_data) {
        free(data);
        if (d_data) cuMemFree(d_data);
        return CUDA_SAM3D_E_INVAL;
    }
    for (int i = 0; i < 3; i++) {
        if (dims[i] <= 0) {
            free(data);
            cuMemFree(d_data);
            return CUDA_SAM3D_E_INVAL;
        }
        ctx->occupancy.dims[i] = dims[i];
    }
    ctx->occupancy.ndim = 3;
    ctx->occupancy.data = data;
    ctx->d_occupancy = d_data;
    return CUDA_SAM3D_E_OK;
}

static int cs3d_ensure_ssdec_gpu(cuda_sam3d_ctx *ctx)
{
    if (!ctx->cpu_ss_dec) {
        ctx->cpu_ss_dec = sam3d_cpu_ss_dec_load(ctx->safetensors_dir_resolved);
        if (!ctx->cpu_ss_dec) {
            fprintf(stderr, "cuda_sam3d: ss_decoder load failed (dir=%s)\n",
                    ctx->safetensors_dir_resolved);
            return CUDA_SAM3D_E_LOAD;
        }
    }
    if (!ctx->gpu_ssdec_loaded) {
        const t2_ss_dec *m = (const t2_ss_dec *)sam3d_cpu_ss_dec_model(ctx->cpu_ss_dec);
        if (!m || cs3d_ssdec_gpu_load(&ctx->gpu_ssdec, m, ctx->cfg.verbose) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_decoder weight upload failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_ssdec_loaded = 1;
        if (cs3d_ssdec_fns_init(&ctx->gpu_ssdec_fns, ctx->mod) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_decoder fns lookup failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
    }
    if (!ctx->gpu_ssdec_ws_alloced) {
        if (cs3d_ssdec_ws_alloc(&ctx->gpu_ssdec_ws) < 0) {
            fprintf(stderr, "cuda_sam3d: gpu ss_decoder workspace alloc failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_ssdec_ws_alloced = 1;
    }
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_run_ss_decode(cuda_sam3d_ctx *ctx) {
    double t0 = cs3d_time_ms();
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_nd *lat = cs3d_active_ss_latent(ctx);
    if (!lat->data) {
        fprintf(stderr, "cuda_sam3d: ss_decode needs ss_latent — "
                        "run ss_dit (or override) first\n");
        return CUDA_SAM3D_E_NO_INPUT;
    }
    if (lat->ndim != 4 || lat->dims[0] != 8 || lat->dims[1] != 16 ||
        lat->dims[2] != 16 || lat->dims[3] != 16) {
        fprintf(stderr, "cuda_sam3d: ss_decode expects ss_latent [8,16,16,16], "
                        "got ndim=%d [%d,%d,%d,%d]\n",
                lat->ndim, lat->dims[0], lat->dims[1], lat->dims[2], lat->dims[3]);
        return CUDA_SAM3D_E_INVAL;
    }
    int rc = cs3d_ensure_ssdec_gpu(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;

    CUdeviceptr d_lat = 0, d_out = 0;
    int own_d_lat = 0;
    size_t lat_bytes = (size_t)8 * 16 * 16 * 16 * sizeof(float);
    if (lat == &ctx->ss_latent && ctx->d_ss_latent) {
        d_lat = ctx->d_ss_latent;
    } else {
        d_lat = cu_upload_raw(lat->data, lat_bytes);
        own_d_lat = 1;
    }
    if (!d_lat) return CUDA_SAM3D_E_LOAD;
    if (cuMemAlloc(&d_out, (size_t)64 * 64 * 64 * sizeof(float)) != CUDA_SUCCESS) {
        if (own_d_lat) cuMemFree(d_lat);
        return CUDA_SAM3D_E_LOAD;
    }
    if (cs3d_ssdec_forward(&ctx->gpu_ssdec, &ctx->gpu_ssdec_fns,
                           &ctx->gpu_ssdec_ws, d_lat, d_out,
                           ctx->cfg.verbose) < 0) {
        fprintf(stderr, "cuda_sam3d: gpu ss_decoder forward failed\n");
        if (own_d_lat) cuMemFree(d_lat);
        cuMemFree(d_out);
        return CUDA_SAM3D_E_LOAD;
    }
    if (own_d_lat) cuMemFree(d_lat);

    float *logits = (float *)malloc((size_t)64 * 64 * 64 * sizeof(float));
    if (!logits) { cuMemFree(d_out); return CUDA_SAM3D_E_LOAD; }
    if (cuMemcpyDtoH(logits, d_out, (size_t)64 * 64 * 64 * sizeof(float)) != CUDA_SUCCESS) {
        free(logits); cuMemFree(d_out); return CUDA_SAM3D_E_LOAD;
    }
    if (ctx->cfg.verbose >= 1) {
        float mn = logits[0], mx = logits[0];
        double sum = 0.0;
        int pos = 0;
        for (int i = 0; i < 64 * 64 * 64; i++) {
            float v = logits[i];
            if (v < mn) mn = v;
            if (v > mx) mx = v;
            sum += v;
            pos += (v > 0.0f);
        }
        fprintf(stderr,
                "cuda_sam3d: ss_decode occupancy min=%.6g max=%.6g mean=%.6g pos=%d\n",
                mn, mx, sum / (64.0 * 64.0 * 64.0), pos);
    }
    const int dims[3] = {64, 64, 64};
    rc = cs3d_adopt_occupancy_device(ctx, logits, dims, d_out);
    d_out = 0;
    ctx->profile.ss_decode_ms = cs3d_time_ms() - t0;
    return rc;
}
/* Active occupancy source: prefer override. */
static const cs3d_host_nd *cs3d_active_occupancy(const cuda_sam3d_ctx *ctx)
{
    return ctx->ovr_occupancy.data ? &ctx->ovr_occupancy : &ctx->occupancy;
}

