lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
static int cs3d_ensure_slat_dit(cuda_sam3d_ctx *ctx) {
    if (ctx->cpu_slat_dit) return CUDA_SAM3D_E_OK;
    ctx->cpu_slat_dit = sam3d_cpu_slat_dit_load(ctx->safetensors_dir_resolved);
    if (!ctx->cpu_slat_dit) {
        fprintf(stderr, "cuda_sam3d: slat_dit load failed (dir=%s)\n",
                ctx->safetensors_dir_resolved);
        return CUDA_SAM3D_E_LOAD;
    }
    return CUDA_SAM3D_E_OK;
}

static int cs3d_ensure_slatdit_gpu(cuda_sam3d_ctx *ctx, int n_max, int n_cond)
{
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    sam3d_slat_dit_model *m = sam3d_cpu_slat_dit_model(ctx->cpu_slat_dit);
    if (!m) return CUDA_SAM3D_E_LOAD;

    if (!ctx->gpu_slatdit_loaded) {
        if (cs3d_slatdit_gpu_load_transformer(&ctx->gpu_slatdit, m, ctx->cfg.verbose) != 0) {
            fprintf(stderr, "cuda_sam3d: gpu slat_dit transformer weight upload failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_slatdit_loaded = 1;
        if (cs3d_slatdit_fns_lookup(&ctx->gpu_slatdit_fns, ctx->mod) != 0) {
            fprintf(stderr, "cuda_sam3d: gpu slat_dit fns lookup failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
    }

    if (ctx->gpu_slatdit_ws_alloced &&
        (n_max > ctx->gpu_slatdit_ws_n || n_cond > ctx->gpu_slatdit_ws_nc)) {
        cs3d_slatdit_block_ws_free(&ctx->gpu_slatdit_ws);
        ctx->gpu_slatdit_ws_alloced = 0;
    }
    if (!ctx->gpu_slatdit_ws_alloced) {
        if (cs3d_slatdit_block_ws_alloc(&ctx->gpu_slatdit_ws, n_max, n_cond,
                                        ctx->gpu_slatdit.dim,
                                        ctx->gpu_slatdit.mlp_hidden) != 0) {
            fprintf(stderr, "cuda_sam3d: gpu slat_dit transformer ws alloc failed\n");
            return CUDA_SAM3D_E_LOAD;
        }
        ctx->gpu_slatdit_ws_alloced = 1;
        ctx->gpu_slatdit_ws_n = n_max;
        ctx->gpu_slatdit_ws_nc = n_cond;
    }
    return CUDA_SAM3D_E_OK;
}

static int cs3d_ensure_devbuf(CUdeviceptr *ptr, size_t *cap, size_t need)
{
    if (!ptr || !cap || need == 0) return -1;
    if (*ptr && *cap >= need) return 0;
    if (*ptr) {
        cuMemFree(*ptr);
        *ptr = 0;
        *cap = 0;
    }
    if (cuMemAlloc(ptr, need) != CUDA_SUCCESS) return -1;
    *cap = need;
    return 0;
}

static int cs3d_slat_cached_t_emb(cuda_sam3d_ctx *ctx, const float *t_emb,
                                  int dim, CUdeviceptr *out)
{
    if (!ctx || !t_emb || dim <= 0 || !out) return -1;
    size_t bytes = (size_t)dim * sizeof(float);
    if (cs3d_ensure_devbuf(&ctx->d_slat_hook_t_emb,
                           &ctx->slat_hook_t_emb_bytes, bytes) != 0)
        return -1;

    int cached = 0;
    if (ctx->slat_hook_t_emb_cache &&
        ctx->slat_hook_t_emb_cache_bytes == bytes &&
        memcmp(ctx->slat_hook_t_emb_cache, t_emb, bytes) == 0) {
        cached = 1;
    }
    if (!cached) {
        float *cache = (float *)realloc(ctx->slat_hook_t_emb_cache, bytes);
        if (!cache) return -1;
        memcpy(cache, t_emb, bytes);
        ctx->slat_hook_t_emb_cache = cache;
        ctx->slat_hook_t_emb_cache_bytes = bytes;
        if (cuMemcpyHtoD(ctx->d_slat_hook_t_emb, t_emb, bytes) != CUDA_SUCCESS)
            return -1;
    }

    *out = ctx->d_slat_hook_t_emb;
    return 0;
}

static int cs3d_upload_cached_i32(CUdeviceptr dst, const int32_t *src,
                                  size_t bytes, int32_t **cachep,
                                  size_t *cache_bytes)
{
    if (!dst || !src || bytes == 0 || !cachep || !cache_bytes) return -1;
    if (*cachep && *cache_bytes == bytes &&
        memcmp(*cachep, src, bytes) == 0) {
        return 0;
    }

    int32_t *cache = (int32_t *)realloc(*cachep, bytes);
    if (!cache) return -1;
    memcpy(cache, src, bytes);
    *cachep = cache;
    *cache_bytes = bytes;
    return cuMemcpyHtoD(dst, src, bytes) == CUDA_SUCCESS ? 0 : -1;
}

static void cs3d_slat_note_feat_cache(cuda_sam3d_ctx *ctx, const float *host,
                                      CUdeviceptr dev, int n, int c)
{
    if (!ctx) return;
    ctx->slat_feat_cache_host = host;
    ctx->slat_feat_cache_dev = dev;
    ctx->slat_feat_cache_n = n;
    ctx->slat_feat_cache_c = c;
}

static void cs3d_slat_clear_feat_cache(cuda_sam3d_ctx *ctx)
{
    cs3d_slat_note_feat_cache(ctx, NULL, 0, 0, 0);
}

static int cs3d_slat_copy_cached_feats(cuda_sam3d_ctx *ctx, CUdeviceptr dst,
                                       const float *host, int n, int c,
                                       int *used_cache)
{
    if (used_cache) *used_cache = 0;
    if (!ctx || !dst || !host || n <= 0 || c <= 0) return -1;
    if (ctx->slat_feat_cache_host == host &&
        ctx->slat_feat_cache_dev &&
        ctx->slat_feat_cache_n == n &&
        ctx->slat_feat_cache_c == c) {
        size_t bytes = (size_t)n * c * sizeof(float);
        if (dst != ctx->slat_feat_cache_dev &&
            cuMemcpyDtoD(dst, ctx->slat_feat_cache_dev, bytes) != CUDA_SUCCESS)
            return -1;
        if (used_cache) *used_cache = 1;
        cs3d_slat_clear_feat_cache(ctx);
        return 0;
    }
    cs3d_slat_clear_feat_cache(ctx);
    return 0;
}

static void cs3d_slat_note_coord_cache(cuda_sam3d_ctx *ctx,
                                       const int32_t *host,
                                       CUdeviceptr dev, int n)
{
    if (!ctx) return;
    ctx->slat_coord_cache_host = host;
    ctx->slat_coord_cache_dev = dev;
    ctx->slat_coord_cache_n = n;
}

static void cs3d_slat_clear_coord_cache(cuda_sam3d_ctx *ctx)
{
    cs3d_slat_note_coord_cache(ctx, NULL, 0, 0);
}

static int cs3d_slat_copy_cached_coords(cuda_sam3d_ctx *ctx, CUdeviceptr dst,
                                        const int32_t *host, int n,
                                        int *used_cache)
{
    if (used_cache) *used_cache = 0;
    if (!ctx || !dst || !host || n <= 0) return -1;
    if (ctx->slat_coord_cache_host == host &&
        ctx->slat_coord_cache_dev &&
        ctx->slat_coord_cache_n == n) {
        size_t bytes = (size_t)n * 4 * sizeof(int32_t);
        if (dst != ctx->slat_coord_cache_dev &&
            cuMemcpyDtoD(dst, ctx->slat_coord_cache_dev, bytes) != CUDA_SUCCESS)
            return -1;
        if (used_cache) *used_cache = 1;
        cs3d_slat_clear_coord_cache(ctx);
        return 0;
    }
    cs3d_slat_clear_coord_cache(ctx);
    return 0;
}

static int cs3d_slat_io_upload_qtensor(const qtensor *t, const char *name,
                                       CUdeviceptr *out, size_t *total_bytes)
{
    if (!t || !t->data || t->n_rows <= 0 || t->n_cols <= 0 || !out)
        return -1;
    int n = t->n_rows * t->n_cols;
    float *buf = (float *)malloc((size_t)n * sizeof(float));
    if (!buf) return -1;
    if (t->type == GGML_TYPE_F32) {
        memcpy(buf, t->data, (size_t)n * sizeof(float));
    } else if (t->type == GGML_TYPE_F16) {
        const uint16_t *src = (const uint16_t *)t->data;
        for (int i = 0; i < n; i++) buf[i] = ggml_fp16_to_fp32(src[i]);
    } else {
        int bs = 0, ts = 0;
        switch (t->type) {
            case GGML_TYPE_Q8_0: bs = 32;  ts = 34;  break;
            case GGML_TYPE_Q4_K: bs = 256; ts = 144; break;
            case GGML_TYPE_Q6_K: bs = 256; ts = 210; break;
            default:
                free(buf);
                fprintf(stderr, "cuda_sam3d: unsupported SLAT IO tensor %s\n", name);
                return -1;
        }
        size_t row_bytes = (size_t)((t->n_cols + bs - 1) / bs) * ts;
        for (int r = 0; r < t->n_rows; r++) {
            const void *row = (const uint8_t *)t->data + (size_t)r * row_bytes;
            dequant_row(t->type, row, buf + (size_t)r * t->n_cols, t->n_cols);
        }
    }
    size_t bytes = (size_t)n * sizeof(float);
    *out = cu_upload_raw(buf, bytes);
    free(buf);
    if (!*out) {
        fprintf(stderr, "cuda_sam3d: SLAT IO upload failed for %s\n", name);
        return -1;
    }
    if (total_bytes) *total_bytes += bytes;
    return 0;
}

