lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
static int cs3d_slat_io_load_block(cs3d_slat_io_block_gpu *dst,
                                   const sam3d_slat_io_block *src,
                                   const char *name,
                                   size_t *total_bytes)
{
    if (!dst || !src) return -1;
    memset(dst, 0, sizeof(*dst));
    dst->C_in = src->C_in;
    dst->C_out = src->C_out;
    dst->updown = src->updown;
    dst->has_skip = src->has_skip;
#define UP_IO_(field) do { \
    char tname[128]; \
    snprintf(tname, sizeof(tname), "%s.%s", name, #field); \
    if (cs3d_slat_io_upload_qtensor(&src->field, tname, &dst->field, total_bytes) != 0) goto fail; \
} while (0)
    UP_IO_(norm1_w); UP_IO_(norm1_b);
    UP_IO_(conv1_w); UP_IO_(conv1_b);
    UP_IO_(conv2_w); UP_IO_(conv2_b);
    UP_IO_(emb_w);   UP_IO_(emb_b);
    if (src->has_skip) {
        UP_IO_(skip_w); UP_IO_(skip_b);
    }
#undef UP_IO_
    return 0;
fail:
    cs3d_slat_io_block_gpu_free(dst);
    return -1;
}

static int cs3d_slat_io_fns_lookup(cs3d_slat_io_fns *f, CUmodule mod)
{
    if (!f) return -1;
    if (f->loaded) return 0;
    if (cuModuleGetFunction(&f->gemm, mod, "gemm_f32_bias") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->down, mod, "slat_downsample2_mean_include_self_serial_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->up, mod, "slat_upsample2_nearest_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->idx, mod, "slat_build_coord_index64_i32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->ln, mod, "layernorm_token_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->silu, mod, "silu_inplace_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->conv, mod, "slat_submconv3x3_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->modln, mod, "modulated_ln_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->resadd, mod, "residual_add_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&f->concat, mod, "slat_concat_feats_f32") != CUDA_SUCCESS)
        return -1;
    f->loaded = 1;
    return 0;
}

static int cs3d_ensure_slat_io_gpu(cuda_sam3d_ctx *ctx)
{
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    sam3d_slat_dit_model *m = sam3d_cpu_slat_dit_model(ctx->cpu_slat_dit);
    if (!m || m->n_io_res_blocks != 2) return CUDA_SAM3D_E_LOAD;
    if (cs3d_slat_io_fns_lookup(&ctx->gpu_slat_io_fns, ctx->mod) != 0) {
        fprintf(stderr, "cuda_sam3d: gpu slat IO fns lookup failed\n");
        return CUDA_SAM3D_E_LOAD;
    }
    if (ctx->gpu_slat_io.loaded) return CUDA_SAM3D_E_OK;

    size_t total = 0;
    if (cs3d_slat_io_load_block(&ctx->gpu_slat_io.input[0], &m->input_blocks[0], "input_blocks.0", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.input[1], &m->input_blocks[1], "input_blocks.1", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.output[0], &m->out_blocks[0], "out_blocks.0", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.output[1], &m->out_blocks[1], "out_blocks.1", &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->input_w, "input_layer.weight", &ctx->gpu_slat_io.input_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->input_b, "input_layer.bias", &ctx->gpu_slat_io.input_b, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_w, "out_layer.weight", &ctx->gpu_slat_io.out_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_b, "out_layer.bias", &ctx->gpu_slat_io.out_b, &total) != 0) {
        cs3d_slat_io_gpu_free(&ctx->gpu_slat_io);
        fprintf(stderr, "cuda_sam3d: gpu slat IO weight upload failed\n");
        return CUDA_SAM3D_E_LOAD;
    }
    ctx->gpu_slat_io.input_in = m->input_w.n_cols;
    ctx->gpu_slat_io.input_out = m->input_w.n_rows;
    ctx->gpu_slat_io.out_in = m->out_w.n_cols;
    ctx->gpu_slat_io.out_out = m->out_w.n_rows;
    ctx->gpu_slat_io.total_bytes = total;
    ctx->gpu_slat_io.loaded = 1;
    if (ctx->cfg.verbose >= 1)
        fprintf(stderr, "cuda_sam3d: SLAT IO GPU weights %.2f MiB\n",
                (double)total / (1024.0 * 1024.0));
    return CUDA_SAM3D_E_OK;
}

static int cs3d_slat_io_block_gpu_hook(void *user, int is_output,
                                       int block_idx, const void *bk_void,
                                       void *xp_void, const float *t_emb,
                                       const int32_t *up_target_coords,
                                       int up_target_N, int dim, float ln_eps)
{
    cuda_sam3d_ctx *ctx = (cuda_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    const sam3d_slat_io_block *bk = (const sam3d_slat_io_block *)bk_void;
    if (!ctx || !xp || !*xp || !bk || !t_emb || block_idx < 0 || block_idx >= 2)
        return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C != bk->C_in) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    cs3d_slat_io_block_gpu *gb = is_output ? &ctx->gpu_slat_io.output[block_idx]
                                           : &ctx->gpu_slat_io.input[block_idx];
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int C_in = gb->C_in, C_out = gb->C_out;
    if (C_in != bk->C_in || C_out != bk->C_out) return -1;
    if (gb->updown == SAM3D_SLAT_UPDOWN_UP && (!up_target_coords || up_target_N <= 0))
        return -1;

    int inN = x->N;
    int outN = (gb->updown == SAM3D_SLAT_UPDOWN_UP) ? up_target_N : inN;
    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    CUdeviceptr d_coords = 0, d_base = 0;
    int32_t *host_coords = NULL;
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;

    size_t in_coord_bytes = (size_t)inN * 4 * sizeof(int32_t);
    size_t in_feat_bytes = (size_t)inN * C_in * sizeof(float);
    size_t t_bytes = (size_t)dim * sizeof(float);
    CUdeviceptr d_t = 0;
    int used_coord_cache = 0;
    int used_feat_cache = 0;
    if (cs3d_ensure_devbuf(&ws->d_in_coords, &ws->cap_in_coords, in_coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_in_feats,  &ws->cap_in_feats,  in_feat_bytes) != 0 ||
        cs3d_slat_cached_t_emb(ctx, t_emb, dim, &d_t) != 0)
        goto done;
    if (cs3d_slat_copy_cached_coords(ctx, ws->d_in_coords, x->coords,
                                     inN, &used_coord_cache) != 0 ||
        cs3d_slat_copy_cached_feats(ctx, ws->d_in_feats, x->feats,
                                    inN, C_in, &used_feat_cache) != 0)
        goto done;
    if (!used_coord_cache &&
        cs3d_upload_cached_i32(ws->d_in_coords, x->coords, in_coord_bytes,
                               &ws->in_coords_cache,
                               &ws->in_coords_cache_bytes) != 0)
        goto done;
    if (!used_feat_cache &&
        cuMemcpyHtoD(ws->d_in_feats, x->feats, in_feat_bytes) != CUDA_SUCCESS)
        goto done;

    if (gb->updown == SAM3D_SLAT_UPDOWN_DOWN) {
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, in_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   in_feat_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_counts, &ws->cap_counts, (size_t)inN * sizeof(int)) != 0 ||
            cs3d_ensure_devbuf(&ws->d_outN,   &ws->cap_outN,   sizeof(int)) != 0)
            goto done;
        ws->coords_cache_bytes = 0;
        d_coords = ws->d_coords;
        d_base = ws->d_base;
        void *a_down[] = { &ws->d_in_coords, &ws->d_in_feats, &inN, &C_in,
                           &d_coords, &d_base, &ws->d_counts, &ws->d_outN };
        if (cuLaunchKernel(fn->down, 1, 1, 1, 1, 1, 1, 0, 0, a_down, NULL) != CUDA_SUCCESS)
            goto done;
        if (cuMemcpyDtoH(&outN, ws->d_outN, sizeof(int)) != CUDA_SUCCESS ||
            outN <= 0 || outN > inN)
            goto done;
    } else if (gb->updown == SAM3D_SLAT_UPDOWN_UP) {
        size_t out_coord_bytes = (size_t)up_target_N * 4 * sizeof(int32_t);
        size_t base_bytes = (size_t)up_target_N * C_in * sizeof(float);
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, out_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   base_bytes) != 0)
            goto done;
        if (cs3d_upload_cached_i32(ws->d_coords, up_target_coords, out_coord_bytes,
                                   &ws->coords_cache,
                                   &ws->coords_cache_bytes) != 0)
            goto done;
        d_coords = ws->d_coords;
        d_base = ws->d_base;
        void *a_up[] = { &ws->d_in_coords, &ws->d_in_feats, &inN, &C_in,
                         &d_coords, &up_target_N, &d_base };
        if (cuLaunchKernel(fn->up, (up_target_N + 127) / 128, 1, 1, 128, 1, 1, 0, 0, a_up, NULL) != CUDA_SUCCESS)
            goto done;
    } else {
        d_coords = ws->d_in_coords;
        d_base = ws->d_in_feats;
    }

    size_t index_bytes = (size_t)64 * 64 * 64 * sizeof(int);
    size_t emb_bytes = (size_t)2 * C_out * sizeof(float);
    size_t skip_bytes = (size_t)outN * C_out * sizeof(float);
    size_t h1_bytes = (size_t)outN * C_in * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_index,  &ws->cap_index,  index_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_t_silu, &ws->cap_t_silu, t_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_emb,    &ws->cap_emb,    emb_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_skip,   &ws->cap_skip,   skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,     &ws->cap_h1,     h1_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2,     &ws->cap_h2,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h3,     &ws->cap_h3,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h4,     &ws->cap_h4,     skip_bytes) != 0)
        goto done;

