lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    if (cuMemsetD8(ws->d_index, 0xff, index_bytes) != CUDA_SUCCESS ||
        cuMemcpyDtoD(ws->d_t_silu, d_t, t_bytes) != CUDA_SUCCESS)
        goto done;
    void *a_idx[] = { &d_coords, &outN, &ws->d_index };
    if (cuLaunchKernel(fn->idx, (outN + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_idx, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_s0[] = { &ws->d_t_silu, &dim };
    if (cuLaunchKernel(fn->silu, (dim + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s0, NULL) != CUDA_SUCCESS)
        goto done;
    int twoCout = 2 * C_out, one = 1;
    { unsigned gx = 1, gy = (twoCout + 15) / 16;
      void *a[] = { &ws->d_emb, &ws->d_t_silu, &gb->emb_w, &gb->emb_b, &one, &dim, &twoCout };
      if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS) goto done; }
    if (gb->has_skip) {
        unsigned gx = (outN + 15) / 16, gy = (C_out + 15) / 16;
        void *a[] = { &ws->d_skip, &d_base, &gb->skip_w, &gb->skip_b, &outN, &C_in, &C_out };
        if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS) goto done;
    } else {
        if (C_in != C_out ||
            cuMemcpyDtoD(ws->d_skip, d_base, (size_t)outN * C_out * sizeof(float)) != CUDA_SUCCESS)
            goto done;
    }

    int affine = 1;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    int n_elem_in = outN * C_in;
    int n_elem_out = outN * C_out;
    int total_conv = outN * C_out;
    CUdeviceptr d_scale = ws->d_emb;
    CUdeviceptr d_shift = ws->d_emb + (size_t)C_out * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &d_base, &gb->norm1_w, &gb->norm1_b,
                     &outN, &C_in, &ln_eps, &affine };
    if (cuLaunchKernel(fn->ln, outN, 1, 1, threads, 1, 1, (unsigned)ln_smem, 0, a_ln, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_s1[] = { &ws->d_h1, &n_elem_in };
    if (cuLaunchKernel(fn->silu, (n_elem_in + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s1, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_c1[] = { &d_coords, &ws->d_h1, &ws->d_index, &gb->conv1_w, &gb->conv1_b,
                     &outN, &C_in, &C_out, &ws->d_h2 };
    if (cuLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_c1, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_ml[] = { &ws->d_h3, &ws->d_h2, &d_shift, &d_scale, &outN, &C_out, &ln_eps };
    if (cuLaunchKernel(fn->modln, outN, 1, 1, threads, 1, 1, (unsigned)ln_smem, 0, a_ml, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_s2[] = { &ws->d_h3, &n_elem_out };
    if (cuLaunchKernel(fn->silu, (n_elem_out + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s2, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_c2[] = { &d_coords, &ws->d_h3, &ws->d_index, &gb->conv2_w, &gb->conv2_b,
                     &outN, &C_out, &C_out, &ws->d_h4 };
    if (cuLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_c2, NULL) != CUDA_SUCCESS)
        goto done;
    void *a_ra[] = { &ws->d_h4, &ws->d_skip, &n_elem_out };
    if (cuLaunchKernel(fn->resadd, (n_elem_out + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_ra, NULL) != CUDA_SUCCESS)
        goto done;

    host_coords = (int32_t *)malloc((size_t)outN * 4 * sizeof(int32_t));
    host_feats = (float *)malloc((size_t)outN * C_out * sizeof(float));
    if (!host_coords || !host_feats) goto done;
    if (cuMemcpyDtoH(host_coords, d_coords, (size_t)outN * 4 * sizeof(int32_t)) != CUDA_SUCCESS ||
        cuMemcpyDtoH(host_feats, ws->d_h4, (size_t)outN * C_out * sizeof(float)) != CUDA_SUCCESS)
        goto done;
    new_t = sp3d_create(host_coords, host_feats, outN, C_out, x->batch_size);
    if (!new_t) goto done;
    cs3d_slat_note_coord_cache(ctx, new_t->coords, d_coords, outN);
    cs3d_slat_note_feat_cache(ctx, new_t->feats, ws->d_h4, outN, C_out);
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_coords);
    free(host_feats);
    return rc;
}

static int cs3d_slat_io_block_forward_device(cuda_sam3d_ctx *ctx,
                                             int is_output, int block_idx,
                                             CUdeviceptr d_in_coords,
                                             CUdeviceptr d_in_feats,
                                             int inN, int C_in,
                                             const float *t_emb,
                                             CUdeviceptr d_up_target_coords,
                                             int up_target_N,
                                             int dim, float ln_eps,
                                             CUdeviceptr *out_coords,
                                             CUdeviceptr *out_feats,
                                             int *outN_p, int *outC_p)
{
    if (!ctx || !d_in_coords || !d_in_feats || !t_emb || !out_coords ||
        !out_feats || !outN_p || !outC_p || inN <= 0 || C_in <= 0 ||
        block_idx < 0 || block_idx >= 2)
        return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    cs3d_slat_io_block_gpu *gb = is_output ? &ctx->gpu_slat_io.output[block_idx]
                                           : &ctx->gpu_slat_io.input[block_idx];
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    if (C_in != gb->C_in) return -1;
    if (gb->updown == SAM3D_SLAT_UPDOWN_UP &&
        (!d_up_target_coords || up_target_N <= 0))
        return -1;

    int C_out = gb->C_out;
    int outN = (gb->updown == SAM3D_SLAT_UPDOWN_UP) ? up_target_N : inN;
    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    CUdeviceptr d_coords = 0, d_base = 0, d_t = 0;
    size_t t_bytes = (size_t)dim * sizeof(float);
    if (cs3d_slat_cached_t_emb(ctx, t_emb, dim, &d_t) != 0)
        return -1;

    if (gb->updown == SAM3D_SLAT_UPDOWN_DOWN) {
        size_t in_coord_bytes = (size_t)inN * 4 * sizeof(int32_t);
        size_t in_feat_bytes = (size_t)inN * C_in * sizeof(float);
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, in_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   in_feat_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_counts, &ws->cap_counts, (size_t)inN * sizeof(int)) != 0 ||
            cs3d_ensure_devbuf(&ws->d_outN,   &ws->cap_outN,   sizeof(int)) != 0)
            return -1;
        ws->coords_cache_bytes = 0;
        d_coords = ws->d_coords;
        d_base = ws->d_base;
        void *a_down[] = { &d_in_coords, &d_in_feats, &inN, &C_in,
                           &d_coords, &d_base, &ws->d_counts, &ws->d_outN };
        if (cuLaunchKernel(fn->down, 1, 1, 1, 1, 1, 1, 0, 0,
                           a_down, NULL) != CUDA_SUCCESS)
            return -1;
        if (cuMemcpyDtoH(&outN, ws->d_outN, sizeof(int)) != CUDA_SUCCESS ||
            outN <= 0 || outN > inN)
            return -1;
    } else if (gb->updown == SAM3D_SLAT_UPDOWN_UP) {
        size_t out_coord_bytes = (size_t)up_target_N * 4 * sizeof(int32_t);
        size_t base_bytes = (size_t)up_target_N * C_in * sizeof(float);
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, out_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   base_bytes) != 0)
            return -1;
        d_coords = d_up_target_coords;
        d_base = ws->d_base;
        void *a_up[] = { &d_in_coords, &d_in_feats, &inN, &C_in,
                         &d_coords, &up_target_N, &d_base };
        if (cuLaunchKernel(fn->up, (up_target_N + 127) / 128, 1, 1,
                           128, 1, 1, 0, 0, a_up, NULL) != CUDA_SUCCESS)
            return -1;
    } else {
        d_coords = d_in_coords;
        d_base = d_in_feats;
    }

    size_t index_bytes = (size_t)64 * 64 * 64 * sizeof(int);
    size_t emb_bytes = (size_t)2 * C_out * sizeof(float);
    size_t skip_bytes = (size_t)outN * C_out * sizeof(float);
    size_t h1_bytes = (size_t)outN * C_in * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_index,  &ws->cap_index,  index_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_t_silu, &ws->cap_t_silu, t_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_emb,    &ws->cap_emb,    emb_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_skip,   &ws->cap_skip,   skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,     &ws->cap_h1,     h1_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2,     &ws->cap_h2,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h3,     &ws->cap_h3,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h4,     &ws->cap_h4,     skip_bytes) != 0)
        return -1;

