lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    if (cuMemsetD8(ws->d_index, 0xff, index_bytes) != CUDA_SUCCESS ||
        cuMemcpyDtoD(ws->d_t_silu, d_t, t_bytes) != CUDA_SUCCESS)
        return -1;
    void *a_idx[] = { &d_coords, &outN, &ws->d_index };
    if (cuLaunchKernel(fn->idx, (outN + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_idx, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_s0[] = { &ws->d_t_silu, &dim };
    if (cuLaunchKernel(fn->silu, (dim + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_s0, NULL) != CUDA_SUCCESS)
        return -1;
    int twoCout = 2 * C_out, one = 1;
    { unsigned gx = 1, gy = (twoCout + 15) / 16;
      void *a[] = { &ws->d_emb, &ws->d_t_silu, &gb->emb_w, &gb->emb_b,
                    &one, &dim, &twoCout };
      if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1,
                         0, 0, a, NULL) != CUDA_SUCCESS) return -1; }
    if (gb->has_skip) {
        unsigned gx = (outN + 15) / 16, gy = (C_out + 15) / 16;
        void *a[] = { &ws->d_skip, &d_base, &gb->skip_w, &gb->skip_b,
                      &outN, &C_in, &C_out };
        if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1,
                           0, 0, a, NULL) != CUDA_SUCCESS) return -1;
    } else {
        if (C_in != C_out ||
            cuMemcpyDtoD(ws->d_skip, d_base, skip_bytes) != CUDA_SUCCESS)
            return -1;
    }

    int affine = 1;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    int n_elem_in = outN * C_in;
    int n_elem_out = outN * C_out;
    int total_conv = outN * C_out;
    CUdeviceptr d_scale = ws->d_emb;
    CUdeviceptr d_shift = ws->d_emb + (size_t)C_out * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &d_base, &gb->norm1_w, &gb->norm1_b,
                     &outN, &C_in, &ln_eps, &affine };
    if (cuLaunchKernel(fn->ln, outN, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_s1[] = { &ws->d_h1, &n_elem_in };
    if (cuLaunchKernel(fn->silu, (n_elem_in + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_s1, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_c1[] = { &d_coords, &ws->d_h1, &ws->d_index, &gb->conv1_w,
                     &gb->conv1_b, &outN, &C_in, &C_out, &ws->d_h2 };
    if (cuLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_c1, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_ml[] = { &ws->d_h3, &ws->d_h2, &d_shift, &d_scale,
                     &outN, &C_out, &ln_eps };
    if (cuLaunchKernel(fn->modln, outN, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ml, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_s2[] = { &ws->d_h3, &n_elem_out };
    if (cuLaunchKernel(fn->silu, (n_elem_out + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_s2, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_c2[] = { &d_coords, &ws->d_h3, &ws->d_index, &gb->conv2_w,
                     &gb->conv2_b, &outN, &C_out, &C_out, &ws->d_h4 };
    if (cuLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_c2, NULL) != CUDA_SUCCESS)
        return -1;
    void *a_ra[] = { &ws->d_h4, &ws->d_skip, &n_elem_out };
    if (cuLaunchKernel(fn->resadd, (n_elem_out + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, a_ra, NULL) != CUDA_SUCCESS)
        return -1;

    *out_coords = d_coords;
    *out_feats = ws->d_h4;
    *outN_p = outN;
    *outC_p = C_out;
    return 0;
}

static int cs3d_slat_input_layer_forward_device(cuda_sam3d_ctx *ctx,
                                                CUdeviceptr d_in_feats,
                                                int N, int C,
                                                CUdeviceptr *out_feats,
                                                int *outC)
{
    if (!ctx || !d_in_feats || !out_feats || !outC || N <= 0 || C <= 0)
        return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    if (C != ctx->gpu_slat_io.input_in) return -1;
    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    int C_out = ctx->gpu_slat_io.input_out;
    size_t out_bytes = (size_t)N * C_out * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_h1, &ws->cap_h1, out_bytes) != 0)
        return -1;
    unsigned gx = (N + 15) / 16, gy = (C_out + 15) / 16;
    void *a[] = { &ws->d_h1, &d_in_feats, &ctx->gpu_slat_io.input_w,
                  &ctx->gpu_slat_io.input_b, &N, &C, &C_out };
    if (cuLaunchKernel(ctx->gpu_slat_io_fns.gemm, gx, gy, 1, 16, 16, 1,
                       0, 0, a, NULL) != CUDA_SUCCESS)
        return -1;
    *out_feats = ws->d_h1;
    *outC = C_out;
    return 0;
}

static int cs3d_slat_final_layer_forward_device(cuda_sam3d_ctx *ctx,
                                                CUdeviceptr d_in_feats,
                                                int N, int C,
                                                float eps,
                                                CUdeviceptr *out_feats,
                                                int *outC)
{
    if (!ctx || !d_in_feats || !out_feats || !outC || N <= 0 || C <= 0)
        return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    if (C != ctx->gpu_slat_io.out_in) return -1;
    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    int C_out = ctx->gpu_slat_io.out_out;
    size_t in_bytes = (size_t)N * C * sizeof(float);
    size_t out_bytes = (size_t)N * C_out * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_h1, &ws->cap_h1, in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2, &ws->cap_h2, out_bytes) != 0)
        return -1;
    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &d_in_feats, &ctx->gpu_slat_io.out_w,
                     &ctx->gpu_slat_io.out_b, &N, &C, &eps, &affine };
    if (cuLaunchKernel(ctx->gpu_slat_io_fns.ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != CUDA_SUCCESS)
        return -1;
    unsigned gx = (N + 15) / 16, gy = (C_out + 15) / 16;
    void *a[] = { &ws->d_h2, &ws->d_h1, &ctx->gpu_slat_io.out_w,
                  &ctx->gpu_slat_io.out_b, &N, &C, &C_out };
    if (cuLaunchKernel(ctx->gpu_slat_io_fns.gemm, gx, gy, 1, 16, 16, 1,
                       0, 0, a, NULL) != CUDA_SUCCESS)
        return -1;
    *out_feats = ws->d_h2;
    *outC = C_out;
    return 0;
}

static int cs3d_slat_input_layer_gpu_hook(void *user, void *xp_void,
                                          const void *input_w_void,
                                          const void *input_b_void,
                                          int out_channels)
{
    cuda_sam3d_ctx *ctx = (cuda_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    (void)input_w_void;
    (void)input_b_void;
    if (!ctx || !xp || !*xp || out_channels <= 0) return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C <= 0) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    if (x->C != ctx->gpu_slat_io.input_in ||
        out_channels != ctx->gpu_slat_io.input_out)
        return -1;

    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int N = x->N;
    int C = x->C;
    int outC = out_channels;
    size_t in_bytes = (size_t)N * C * sizeof(float);
    size_t out_bytes = (size_t)N * outC * sizeof(float);
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;
    int used_feat_cache = 0;

    if (cs3d_ensure_devbuf(&ws->d_in_feats, &ws->cap_in_feats, in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,       &ws->cap_h1,       out_bytes) != 0)
        goto done;
    if (cs3d_slat_copy_cached_feats(ctx, ws->d_in_feats, x->feats,
                                    N, C, &used_feat_cache) != 0)
        goto done;
    if (!used_feat_cache &&
        cuMemcpyHtoD(ws->d_in_feats, x->feats, in_bytes) != CUDA_SUCCESS)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (outC + 15) / 16;
      void *a[] = { &ws->d_h1, &ws->d_in_feats, &ctx->gpu_slat_io.input_w,
                    &ctx->gpu_slat_io.input_b, &N, &C, &outC };
      if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }

