lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    host_feats = (float *)malloc(out_bytes);
    if (!host_feats) goto done;
    if (cuMemcpyDtoH(host_feats, ws->d_h1, out_bytes) != CUDA_SUCCESS)
        goto done;
    new_t = sp3d_create(x->coords, host_feats, N, outC, x->batch_size);
    if (!new_t) goto done;
    cs3d_slat_note_feat_cache(ctx, new_t->feats, ws->d_h1, N, outC);
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_feats);
    return rc;
}

static int cs3d_slat_final_layer_gpu_hook(void *user, void *xp_void,
                                          const void *out_w_void,
                                          const void *out_b_void,
                                          int out_channels, float eps)
{
    cuda_sam3d_ctx *ctx = (cuda_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    (void)out_w_void;
    (void)out_b_void;
    if (!ctx || !xp || !*xp || out_channels <= 0) return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C <= 0) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    if (x->C != ctx->gpu_slat_io.out_in ||
        out_channels != ctx->gpu_slat_io.out_out)
        return -1;

    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int N = x->N;
    int C = x->C;
    int outC = out_channels;
    size_t in_bytes = (size_t)N * C * sizeof(float);
    size_t out_bytes = (size_t)N * outC * sizeof(float);
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;
    int used_feat_cache = 0;

    if (cs3d_ensure_devbuf(&ws->d_in_feats, &ws->cap_in_feats, in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,       &ws->cap_h1,       in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2,       &ws->cap_h2,       out_bytes) != 0)
        goto done;
    if (cs3d_slat_copy_cached_feats(ctx, ws->d_in_feats, x->feats,
                                    N, C, &used_feat_cache) != 0)
        goto done;
    if (!used_feat_cache &&
        cuMemcpyHtoD(ws->d_in_feats, x->feats, in_bytes) != CUDA_SUCCESS)
        goto done;

    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &ws->d_in_feats,
                     &ctx->gpu_slat_io.out_w, &ctx->gpu_slat_io.out_b,
                     &N, &C, &eps, &affine };
    if (cuLaunchKernel(fn->ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != CUDA_SUCCESS)
        goto done;

    { unsigned gx = (N + 15) / 16, gy = (outC + 15) / 16;
      void *a[] = { &ws->d_h2, &ws->d_h1, &ctx->gpu_slat_io.out_w,
                    &ctx->gpu_slat_io.out_b, &N, &C, &outC };
      if (cuLaunchKernel(fn->gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }

    host_feats = (float *)malloc(out_bytes);
    if (!host_feats) goto done;
    if (cuMemcpyDtoH(host_feats, ws->d_h2, out_bytes) != CUDA_SUCCESS)
        goto done;
    new_t = sp3d_create(x->coords, host_feats, N, outC, x->batch_size);
    if (!new_t) goto done;
    cs3d_slat_note_feat_cache(ctx, new_t->feats, ws->d_h2, N, outC);
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_feats);
    return rc;
}

static int cs3d_slat_transformer_gpu_hook_impl(void *user, float *feats, int N,
                                               const int32_t *coords,
                                               const float *t_emb,
                                               const float *cond, int n_cond,
                                               int dim, int n_blocks,
                                               int apply_ape)
{
    cuda_sam3d_ctx *ctx = (cuda_sam3d_ctx *)user;
    if (!ctx || !feats || !t_emb || !cond || N <= 0 || n_cond <= 0 ||
        (apply_ape && !coords))
        return -1;
    if (cs3d_ensure_slatdit_gpu(ctx, N, n_cond) != CUDA_SAM3D_E_OK)
        return -1;
    if (dim != ctx->gpu_slatdit.dim || n_blocks != ctx->gpu_slatdit.n_blocks)
        return -1;

    size_t x_bytes = (size_t)N * dim * sizeof(float);
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t c_bytes = (size_t)n_cond * dim * sizeof(float);
    CUdeviceptr d_t = 0;
    int used_coord_cache = 0;
    int used_feat_cache = 0;
    if (cs3d_ensure_devbuf(&ctx->d_slat_hook_x, &ctx->slat_hook_x_bytes, x_bytes) != 0 ||
        cs3d_slat_cached_t_emb(ctx, t_emb, dim, &d_t) != 0)
        return -1;
    if (cs3d_slat_copy_cached_feats(ctx, ctx->d_slat_hook_x, feats,
                                    N, dim, &used_feat_cache) != 0)
        return -1;
    if (!used_feat_cache &&
        cuMemcpyHtoD(ctx->d_slat_hook_x, feats, x_bytes) != CUDA_SUCCESS)
        return -1;
    if (apply_ape) {
        hipFunction_t ape_fn = NULL;
        int freq_dim = dim / 3 / 2;
        int filled = freq_dim * 2 * 3;
        long long total = (long long)N * filled;
        if (filled <= 0 ||
            cs3d_ensure_devbuf(&ctx->d_slat_hook_coords, &ctx->slat_hook_coords_bytes,
                               coord_bytes) != 0 ||
            cuModuleGetFunction(&ape_fn, ctx->mod, "slat_ape_add_f32") != CUDA_SUCCESS)
            return -1;
        if (cs3d_slat_copy_cached_coords(ctx, ctx->d_slat_hook_coords,
                                         coords, N, &used_coord_cache) != 0)
            return -1;
        int coords_cached = 0;
        if (ctx->slat_hook_coords_cache &&
            ctx->slat_hook_coords_cache_bytes == coord_bytes &&
            memcmp(ctx->slat_hook_coords_cache, coords, coord_bytes) == 0) {
            coords_cached = 1;
        }
        if (!coords_cached) {
            int32_t *cache = (int32_t *)realloc(ctx->slat_hook_coords_cache,
                                                coord_bytes);
            if (!cache) return -1;
            memcpy(cache, coords, coord_bytes);
            ctx->slat_hook_coords_cache = cache;
            ctx->slat_hook_coords_cache_bytes = coord_bytes;
        }
        if (!used_coord_cache && !coords_cached &&
            cuMemcpyHtoD(ctx->d_slat_hook_coords, coords, coord_bytes) != CUDA_SUCCESS)
                return -1;
        void *a_ape[] = { &ctx->d_slat_hook_x, &ctx->d_slat_hook_coords, &N, &dim };
        if (cuLaunchKernel(ape_fn, (unsigned)((total + 255) / 256), 1, 1,
                           256, 1, 1, 0, 0, a_ape, NULL) != CUDA_SUCCESS)
            return -1;
    }

    int own_cond = 1;
    CUdeviceptr d_cond = 0;
    if (cond == ctx->cond_tokens.data && ctx->d_cond_tokens &&
        ctx->cond_tokens.n == n_cond && ctx->cond_tokens.c == dim) {
        d_cond = ctx->d_cond_tokens;
        own_cond = 0;
    } else {
        d_cond = cu_upload_raw(cond, c_bytes);
    }
    if (!d_cond) {
        if (d_cond && own_cond) cuMemFree(d_cond);
        return -1;
    }

    int ok = (cs3d_slatdit_stack_forward(&ctx->gpu_slatdit_fns,
                                         &ctx->gpu_slatdit_ws,
                                         &ctx->gpu_slatdit, 0, n_blocks,
                                         d_t,
                                         ctx->d_slat_hook_x, N, d_cond,
                                         n_cond) == 0);
    if (ok) {
        if (cuMemcpyDtoH(feats, ctx->d_slat_hook_x, x_bytes) != CUDA_SUCCESS) {
            ok = 0;
        } else {
            cs3d_slat_note_feat_cache(ctx, feats, ctx->d_slat_hook_x, N, dim);
        }
    }
    if (own_cond) cuMemFree(d_cond);
    return ok ? 0 : -1;
}

static int cs3d_slat_ape_transformer_gpu_hook(void *user, float *feats, int N,
                                              const int32_t *coords,
                                              const float *t_emb,
                                              const float *cond, int n_cond,
                                              int dim, int n_blocks)
{
    return cs3d_slat_transformer_gpu_hook_impl(user, feats, N, coords, t_emb,
                                               cond, n_cond, dim, n_blocks, 1);
}

static int cs3d_slat_transformer_gpu_hook(void *user, float *feats, int N,
                                          const int32_t *coords,
                                          const float *t_emb,
                                          const float *cond, int n_cond,
                                          int dim, int n_blocks)
{
    return cs3d_slat_transformer_gpu_hook_impl(user, feats, N, coords, t_emb,
                                               cond, n_cond, dim, n_blocks, 0);
}

static void cs3d_slat_unnormalize8_host(float *x, int N)
{
    static const float mean[8] = {
         0.12211431f,  0.37204156f, -1.26521907f, -2.05276058f,
        -3.10432536f, -0.11294304f, -0.85146744f,  0.45506954f,
    };
    static const float stdv[8] = {
         2.37326008f,  2.13174402f,  2.2413953f,   2.30589401f,
         2.1191894f,   1.8969511f,   2.41684989f,  2.08374642f,
    };
    if (!x || N <= 0) return;
    for (int i = 0; i < N; i++) {
        float *r = x + (size_t)i * 8;
        for (int c = 0; c < 8; c++) r[c] = r[c] * stdv[c] + mean[c];
    }
}

static int cs3d_qtensor_numel_local(const qtensor *t)
{
    if (!t || !t->data) return 0;
    int n = 1;
    for (int d = 0; d < t->n_dims; d++) n *= (int)t->dims[d];
    return n;
}

