lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
static const float *cs3d_qtensor_f32_local(const qtensor *t, int *owned)
{
    if (owned) *owned = 0;
    if (!t || !t->data) return NULL;
    if (t->type == GGML_TYPE_F32) return (const float *)t->data;
    if (t->type != GGML_TYPE_F16) return NULL;
    int n = cs3d_qtensor_numel_local(t);
    float *buf = (float *)malloc((size_t)n * sizeof(float));
    if (!buf) return NULL;
    const uint16_t *src = (const uint16_t *)t->data;
    for (int i = 0; i < n; i++) buf[i] = ggml_fp16_to_fp32(src[i]);
    if (owned) *owned = 1;
    return buf;
}

static void cs3d_gemm_m1_f32_local(float *out, const float *W,
                                   const float *b, const float *in,
                                   int N, int K)
{
    for (int r = 0; r < N; r++) {
        const float *w = W + (size_t)r * K;
        float s = b ? b[r] : 0.0f;
#if defined(__AVX2__) && defined(__FMA__)
        __m256 acc = _mm256_setzero_ps();
        int j = 0;
        for (; j + 8 <= K; j += 8) {
            __m256 va = _mm256_loadu_ps(in + j);
            __m256 vw = _mm256_loadu_ps(w + j);
            acc = _mm256_fmadd_ps(va, vw, acc);
        }
        float tail[8];
        _mm256_storeu_ps(tail, acc);
        s += tail[0] + tail[1] + tail[2] + tail[3]
           + tail[4] + tail[5] + tail[6] + tail[7];
        for (; j < K; j++) s += in[j] * w[j];
#else
        for (int j = 0; j < K; j++) s += in[j] * w[j];
#endif
        out[r] = s;
    }
}

static int cs3d_slat_time_mlp_local(float *out, float t,
                                    const qtensor *fc1_w, const qtensor *fc1_b,
                                    const qtensor *fc2_w, const qtensor *fc2_b,
                                    int freq_dim, int dim)
{
    if (!out || !fc1_w || !fc1_b || !fc2_w || !fc2_b ||
        freq_dim <= 0 || dim <= 0)
        return -1;
    float *emb = (float *)malloc((size_t)freq_dim * sizeof(float));
    float *h1  = (float *)malloc((size_t)dim * sizeof(float));
    if (!emb || !h1) {
        free(emb);
        free(h1);
        return -1;
    }
    int half = freq_dim / 2;
    float neg_log10k = -logf(10000.0f);
    for (int j = 0; j < half; j++) {
        float freq = expf(neg_log10k * (float)j / (float)half);
        float arg = t * freq;
        emb[j] = cosf(arg);
        emb[half + j] = sinf(arg);
    }
    int w1o = 0, b1o = 0, w2o = 0, b2o = 0;
    const float *w1 = cs3d_qtensor_f32_local(fc1_w, &w1o);
    const float *b1 = cs3d_qtensor_f32_local(fc1_b, &b1o);
    const float *w2 = cs3d_qtensor_f32_local(fc2_w, &w2o);
    const float *b2 = cs3d_qtensor_f32_local(fc2_b, &b2o);
    int ok = (w1 && b1 && w2 && b2);
    if (ok) {
        cs3d_gemm_m1_f32_local(h1, w1, b1, emb, dim, freq_dim);
        for (int i = 0; i < dim; i++) h1[i] = h1[i] / (1.0f + expf(-h1[i]));
        cs3d_gemm_m1_f32_local(out, w2, b2, h1, dim, dim);
    }
    if (w1o) free((void *)w1);
    if (b1o) free((void *)b1);
    if (w2o) free((void *)w2);
    if (b2o) free((void *)b2);
    free(emb);
    free(h1);
    return ok ? 0 : -1;
}

static int cs3d_slat_ape_transformer_forward_device(cuda_sam3d_ctx *ctx,
                                                    CUdeviceptr d_coords,
                                                    CUdeviceptr d_feats,
                                                    int N,
                                                    const float *t_emb,
                                                    const float *cond,
                                                    int n_cond,
                                                    int dim,
                                                    int n_blocks)
{
    if (!ctx || !d_coords || !d_feats || !t_emb || !cond || N <= 0 ||
        n_cond <= 0)
        return -1;
    if (cs3d_ensure_slatdit_gpu(ctx, N, n_cond) != CUDA_SAM3D_E_OK)
        return -1;
    if (dim != ctx->gpu_slatdit.dim || n_blocks != ctx->gpu_slatdit.n_blocks)
        return -1;

    CUdeviceptr d_t = 0;
    if (cs3d_slat_cached_t_emb(ctx, t_emb, dim, &d_t) != 0)
        return -1;

    hipFunction_t ape_fn = NULL;
    int freq_dim = dim / 3 / 2;
    int filled = freq_dim * 2 * 3;
    long long total = (long long)N * filled;
    if (filled <= 0 ||
        cuModuleGetFunction(&ape_fn, ctx->mod, "slat_ape_add_f32") != CUDA_SUCCESS)
        return -1;
    void *a_ape[] = { &d_feats, &d_coords, &N, &dim };
    if (cuLaunchKernel(ape_fn, (unsigned)((total + 255) / 256), 1, 1,
                       256, 1, 1, 0, 0, a_ape, NULL) != CUDA_SUCCESS)
        return -1;

    int own_cond = 1;
    CUdeviceptr d_cond = 0;
    if (cond == ctx->cond_tokens.data && ctx->d_cond_tokens &&
        ctx->cond_tokens.n == n_cond && ctx->cond_tokens.c == dim) {
        d_cond = ctx->d_cond_tokens;
        own_cond = 0;
    } else {
        d_cond = cu_upload_raw(cond, (size_t)n_cond * dim * sizeof(float));
    }
    if (!d_cond) return -1;
    int ok = (cs3d_slatdit_stack_forward(&ctx->gpu_slatdit_fns,
                                         &ctx->gpu_slatdit_ws,
                                         &ctx->gpu_slatdit, 0, n_blocks,
                                         d_t, d_feats, N, d_cond, n_cond) == 0);
    if (own_cond) cuMemFree(d_cond);
    return ok ? 0 : -1;
}

static int cs3d_slat_dit_device_step(cuda_sam3d_ctx *ctx,
                                     const sam3d_slat_dit_model *m,
                                     const float *cond, int n_cond,
                                     float t,
                                     int *N_io, int *C_io)
{
    if (!ctx || !m || !cond || !N_io || !C_io || *N_io <= 0 || *C_io <= 0)
        return -1;
    if (m->n_io_res_blocks != 2) return -1;
    cs3d_slat_ode_ws *ow = &ctx->gpu_slat_ode_ws;
    if (ow->cap_t_emb < (size_t)m->dim) {
        float *p = (float *)realloc(ow->t_emb, (size_t)m->dim * sizeof(float));
        if (!p) return -1;
        ow->t_emb = p;
        ow->cap_t_emb = (size_t)m->dim;
    }
    if (cs3d_slat_time_mlp_local(ow->t_emb, t, &m->t_emb_fc1_w,
                                 &m->t_emb_fc1_b, &m->t_emb_fc2_w,
                                 &m->t_emb_fc2_b, m->freq_dim, m->dim) != 0)
        return -1;

    int N = *N_io, C = *C_io;
    CUdeviceptr d_coords = ow->d_cur_coords;
    CUdeviceptr d_feats = ow->d_cur_feats;
    if (cs3d_slat_input_layer_forward_device(ctx, d_feats, N, C, &d_feats, &C) != 0)
        return -1;

    for (int i = 0; i < 2; i++) {
        CUdeviceptr next_coords = 0, next_feats = 0;
        int nextN = 0, nextC = 0;
        if (cs3d_slat_io_block_forward_device(ctx, 0, i, d_coords, d_feats,
                                              N, C, ow->t_emb, 0, 0,
                                              m->dim, m->ln_eps,
                                              &next_coords, &next_feats,
                                              &nextN, &nextC) != 0)
            return -1;
        size_t coord_bytes = (size_t)nextN * 4 * sizeof(int32_t);
        size_t feat_bytes = (size_t)nextN * nextC * sizeof(float);
        if (cs3d_ensure_devbuf(&ow->d_skip_coords[i], &ow->cap_skip_coords[i],
                               coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ow->d_skip_feats[i], &ow->cap_skip_feats[i],
                               feat_bytes) != 0 ||
            cuMemcpyDtoD(ow->d_skip_coords[i], next_coords, coord_bytes) != CUDA_SUCCESS ||
            cuMemcpyDtoD(ow->d_skip_feats[i], next_feats, feat_bytes) != CUDA_SUCCESS)
            return -1;
        ow->skip_N[i] = nextN;
        ow->skip_C[i] = nextC;
        d_coords = next_coords;
        d_feats = next_feats;
        N = nextN;
        C = nextC;
    }

    if (C != m->dim ||
        cs3d_slat_ape_transformer_forward_device(ctx, d_coords, d_feats, N,
                                                 ow->t_emb, cond, n_cond,
                                                 m->dim, m->n_blocks) != 0)
        return -1;

    for (int oi = 0; oi < 2; oi++) {
        int si = 1 - oi;
        int Cs = ow->skip_C[si];
        int Cc = C + Cs;
        if (N != ow->skip_N[si]) return -1;
        size_t cat_bytes = (size_t)N * Cc * sizeof(float);
        if (cs3d_ensure_devbuf(&ow->d_cat_feats, &ow->cap_cat_feats,
                               cat_bytes) != 0)
            return -1;
        int total = N * Cc;
        void *a_cat[] = { &ow->d_cat_feats, &d_feats, &ow->d_skip_feats[si],
                          &N, &C, &Cs };
        if (cuLaunchKernel(ctx->gpu_slat_io_fns.concat,
                           (total + 255) / 256, 1, 1, 256, 1, 1,
                           0, 0, a_cat, NULL) != CUDA_SUCCESS)
            return -1;
        d_feats = ow->d_cat_feats;
        C = Cc;
        CUdeviceptr up_coords = 0;
        int upN = 0;
        if (m->out_blocks[oi].updown == SAM3D_SLAT_UPDOWN_UP) {
            int next_si = si - 1;
            if (next_si < 0) return -1;
            up_coords = ow->d_skip_coords[next_si];
            upN = ow->skip_N[next_si];
        }
        CUdeviceptr next_coords = 0, next_feats = 0;
        int nextN = 0, nextC = 0;
        if (cs3d_slat_io_block_forward_device(ctx, 1, oi, d_coords, d_feats,
                                              N, C, ow->t_emb, up_coords, upN,
                                              m->dim, m->ln_eps,
                                              &next_coords, &next_feats,
                                              &nextN, &nextC) != 0)
            return -1;
        d_coords = next_coords;
        d_feats = next_feats;
        N = nextN;
        C = nextC;
    }

    if (cs3d_slat_final_layer_forward_device(ctx, d_feats, N, C, 1e-5f,
                                             &d_feats, &C) != 0)
        return -1;

    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t feat_bytes = (size_t)N * C * sizeof(float);
    if (cs3d_ensure_devbuf(&ow->d_cur_coords, &ow->cap_cur_coords,
                           coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ow->d_cur_feats, &ow->cap_cur_feats,
                           feat_bytes) != 0 ||
        cuMemcpyDtoD(ow->d_cur_coords, d_coords, coord_bytes) != CUDA_SUCCESS ||
        cuMemcpyDtoD(ow->d_cur_feats, d_feats, feat_bytes) != CUDA_SUCCESS)
        return -1;
    *N_io = N;
    *C_io = C;
    return 0;
}

static int cs3d_slat_dit_run_ode_device(cuda_sam3d_ctx *ctx,
                                        CUdeviceptr d_active_coords,
                                        int active_voxels,
                                        const float *cond, int n_cond,
                                        int steps, uint64_t seed,
                                        int32_t **out_coords,
                                        float **out_feats,
                                        int *out_n)
{
    if (!ctx || !d_active_coords || active_voxels <= 0 || !cond ||
        n_cond <= 0 || steps <= 0 || !out_coords || !out_feats || !out_n)
        return -1;
    sam3d_slat_dit_model *m = sam3d_cpu_slat_dit_model(ctx->cpu_slat_dit);
    if (!m || m->in_channels <= 0 || m->out_channels <= 0) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != CUDA_SAM3D_E_OK ||
        cs3d_ensure_slatdit_gpu(ctx, active_voxels, n_cond) != CUDA_SAM3D_E_OK)
        return -1;

    cs3d_slat_ode_ws *ow = &ctx->gpu_slat_ode_ws;
    int N = active_voxels;
    int C = m->in_channels;
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t feat_bytes = (size_t)N * C * sizeof(float);
    float *init_feats = (float *)malloc(feat_bytes);
    if (!init_feats) return -1;
    uint64_t rng = seed ^ 0x5851F42D4C957F2DULL;
    cs3d_ode_fill_randn(init_feats, N * C, &rng);
    int rc = -1;
    if (cs3d_ensure_devbuf(&ow->d_cur_coords, &ow->cap_cur_coords,
                           coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ow->d_cur_feats, &ow->cap_cur_feats,
                           feat_bytes) != 0 ||
        cuMemcpyDtoD(ow->d_cur_coords, d_active_coords, coord_bytes) != CUDA_SUCCESS ||
        cuMemcpyHtoD(ow->d_cur_feats, init_feats, feat_bytes) != CUDA_SUCCESS)
        goto done;

    for (int s = 0; s < steps; s++) {
        float t = 1.0f - (float)s / (float)steps;
        if (cs3d_slat_dit_device_step(ctx, m, cond, n_cond,
                                      t * 1000.0f, &N, &C) != 0)
            goto done;
    }
    if (C != m->out_channels) goto done;

