lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    int32_t *coords = (int32_t *)malloc((size_t)N * 4 * sizeof(int32_t));
    float *feats = (float *)malloc((size_t)N * C * sizeof(float));
    if (!coords || !feats) {
        free(coords);
        free(feats);
        goto done;
    }
    if (cuMemcpyDtoH(coords, ow->d_cur_coords, (size_t)N * 4 * sizeof(int32_t)) != CUDA_SUCCESS ||
        cuMemcpyDtoH(feats, ow->d_cur_feats, (size_t)N * C * sizeof(float)) != CUDA_SUCCESS) {
        free(coords);
        free(feats);
        goto done;
    }
    if (C == 8) cs3d_slat_unnormalize8_host(feats, N);
    *out_coords = coords;
    *out_feats = feats;
    *out_n = N;
    rc = 0;

done:
    free(init_feats);
    return rc;
}

static int cs3d_adopt_slat_device(cuda_sam3d_ctx *ctx, int32_t *coords,
                                  float *feats, int n, int c,
                                  CUdeviceptr src_d_coords,
                                  CUdeviceptr src_d_feats,
                                  int src_needs_unnorm)
{
    cs3d_free_slat(&ctx->slat_tokens);
    if (ctx->d_slat_feats)  { cuMemFree(ctx->d_slat_feats);  ctx->d_slat_feats  = 0; }
    if (ctx->d_slat_coords) { cuMemFree(ctx->d_slat_coords); ctx->d_slat_coords = 0; }
    if (!coords || !feats || n <= 0 || c <= 0) {
        free(coords); free(feats);
        return CUDA_SAM3D_E_INVAL;
    }
    size_t f_bytes = (size_t)n * c * sizeof(float);
    size_t k_bytes = (size_t)n * 4 * sizeof(int32_t);
    if (src_d_feats) {
        if (cuMemAlloc(&ctx->d_slat_feats, f_bytes) != CUDA_SUCCESS ||
            cuMemcpyDtoD(ctx->d_slat_feats, src_d_feats, f_bytes) != CUDA_SUCCESS) {
            if (ctx->d_slat_feats) { cuMemFree(ctx->d_slat_feats); ctx->d_slat_feats = 0; }
            free(coords); free(feats);
            return CUDA_SAM3D_E_LOAD;
        }
        if (src_needs_unnorm && c == 8) {
            hipFunction_t unnorm = NULL;
            int elems = n * c;
            if (cuModuleGetFunction(&unnorm, ctx->mod, "slat_unnormalize8_f32") != CUDA_SUCCESS) {
                cuMemFree(ctx->d_slat_feats); ctx->d_slat_feats = 0;
                free(coords); free(feats);
                return CUDA_SAM3D_E_LOAD;
            }
            void *a[] = { &ctx->d_slat_feats, &n };
            if (cuLaunchKernel(unnorm, (elems + 255) / 256, 1, 1,
                               256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS) {
                cuMemFree(ctx->d_slat_feats); ctx->d_slat_feats = 0;
                free(coords); free(feats);
                return CUDA_SAM3D_E_LOAD;
            }
        }
    } else {
        ctx->d_slat_feats  = cu_upload_raw(feats,  f_bytes);
    }
    if (src_d_coords) {
        if (cuMemAlloc(&ctx->d_slat_coords, k_bytes) != CUDA_SUCCESS ||
            cuMemcpyDtoD(ctx->d_slat_coords, src_d_coords, k_bytes) != CUDA_SUCCESS) {
            if (ctx->d_slat_feats)  { cuMemFree(ctx->d_slat_feats);  ctx->d_slat_feats  = 0; }
            if (ctx->d_slat_coords) { cuMemFree(ctx->d_slat_coords); ctx->d_slat_coords = 0; }
            free(coords); free(feats);
            return CUDA_SAM3D_E_LOAD;
        }
    } else {
        ctx->d_slat_coords = cu_upload_raw(coords, k_bytes);
    }
    if (!ctx->d_slat_feats || !ctx->d_slat_coords) {
        if (ctx->d_slat_feats)  { cuMemFree(ctx->d_slat_feats);  ctx->d_slat_feats  = 0; }
        if (ctx->d_slat_coords) { cuMemFree(ctx->d_slat_coords); ctx->d_slat_coords = 0; }
        free(coords); free(feats);
        return CUDA_SAM3D_E_LOAD;
    }
    ctx->slat_tokens.feats  = feats;
    ctx->slat_tokens.coords = coords;
    ctx->slat_tokens.n      = n;
    ctx->slat_tokens.c      = c;
    return CUDA_SAM3D_E_OK;
}

static int cs3d_slat_argwhere_gpu(cuda_sam3d_ctx *ctx, const cs3d_host_nd *occ,
                                  int32_t **out_coords, int *out_n,
                                  CUdeviceptr *out_d_coords)
{
    if (!ctx || !occ || !occ->data || !out_coords || !out_n ||
        occ->ndim != 3 || occ->dims[0] <= 0 || occ->dims[1] <= 0 ||
        occ->dims[2] <= 0) return CUDA_SAM3D_E_INVAL;

    hipFunction_t fn = NULL;
    if (cuModuleGetFunction(&fn, ctx->mod,
                            "slat_occ_argwhere_serial_f32") != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: missing slat_occ_argwhere_serial_f32\n");
        return CUDA_SAM3D_E_LOAD;
    }

    int D = occ->dims[0], H = occ->dims[1], W = occ->dims[2];
    int occ_n = D * H * W;
    CUdeviceptr d_occ = 0, d_count = 0, d_coords = 0;
    int own_occ = 0;
    if (occ == &ctx->occupancy && ctx->d_occupancy) {
        d_occ = ctx->d_occupancy;
    } else {
        d_occ = cu_upload_raw(occ->data, (size_t)occ_n * sizeof(float));
        own_occ = 1;
        if (!d_occ) return CUDA_SAM3D_E_LOAD;
    }
    if (cuMemAlloc(&d_count, sizeof(int)) != CUDA_SUCCESS ||
        cuMemAlloc(&d_coords, (size_t)occ_n * 4 * sizeof(int32_t)) != CUDA_SUCCESS) {
        if (d_count) cuMemFree(d_count);
        if (d_coords) cuMemFree(d_coords);
        if (own_occ) cuMemFree(d_occ);
        return CUDA_SAM3D_E_LOAD;
    }

    void *args[] = { &d_occ, &D, &H, &W, &d_count, &d_coords };
    CUresult lrc = cuLaunchKernel(fn, 1, 1, 1, 1, 1, 1, 0, NULL, args, NULL);
    if (lrc == CUDA_SUCCESS) lrc = cuCtxSynchronize();
    int count = 0;
    if (lrc == CUDA_SUCCESS)
        lrc = cuMemcpyDtoH(&count, d_count, sizeof(int));
    if (lrc != CUDA_SUCCESS || count < 0 || count > occ_n) {
        cuMemFree(d_count);
        cuMemFree(d_coords);
        if (own_occ) cuMemFree(d_occ);
        return CUDA_SAM3D_E_LOAD;
    }
    if (count == 0) {
        cuMemFree(d_count);
        cuMemFree(d_coords);
        if (own_occ) cuMemFree(d_occ);
        *out_coords = NULL;
        *out_n = 0;
        if (out_d_coords) *out_d_coords = 0;
        return CUDA_SAM3D_E_OK;
    }

    int32_t *coords = (int32_t *)malloc((size_t)count * 4 * sizeof(int32_t));
    if (!coords) {
        cuMemFree(d_count);
        cuMemFree(d_coords);
        if (own_occ) cuMemFree(d_occ);
        return CUDA_SAM3D_E_LOAD;
    }
    lrc = cuMemcpyDtoH(coords, d_coords, (size_t)count * 4 * sizeof(int32_t));
    cuMemFree(d_count);
    if (own_occ) cuMemFree(d_occ);
    if (lrc != CUDA_SUCCESS) {
        cuMemFree(d_coords);
        free(coords);
        return CUDA_SAM3D_E_LOAD;
    }
    *out_coords = coords;
    *out_n = count;
    if (out_d_coords) {
        *out_d_coords = d_coords;
    } else {
        cuMemFree(d_coords);
    }
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_run_slat_dit(cuda_sam3d_ctx *ctx) {
    double t0 = cs3d_time_ms();
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_2d *cond = cs3d_active_cond(ctx);
    if (!cond->data) {
        fprintf(stderr, "cuda_sam3d: slat_dit needs cond tokens — "
                        "run cond_fuser (or override) first\n");
        return CUDA_SAM3D_E_NO_INPUT;
    }
    const cs3d_host_nd *occ = cs3d_active_occupancy(ctx);
    if (!occ->data) {
        fprintf(stderr, "cuda_sam3d: slat_dit needs occupancy — "
                        "run ss_decode (or override) first\n");
        return CUDA_SAM3D_E_NO_INPUT;
    }
    if (occ->ndim != 3 || occ->dims[0] != 64 || occ->dims[1] != 64 ||
        occ->dims[2] != 64) {
        fprintf(stderr, "cuda_sam3d: slat_dit expects occupancy [64,64,64], "
                        "got ndim=%d [%d,%d,%d]\n",
                occ->ndim, occ->dims[0], occ->dims[1], occ->dims[2]);
        return CUDA_SAM3D_E_INVAL;
    }
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;

    int steps = ctx->cfg.slat_steps > 0 ? ctx->cfg.slat_steps : 12;

    int32_t *active_coords = NULL;
    CUdeviceptr active_d_coords = 0;
    int active_voxels = 0;
    rc = cs3d_slat_argwhere_gpu(ctx, occ, &active_coords, &active_voxels,
                                &active_d_coords);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    if (ctx->cfg.verbose >= 1) {
        fprintf(stderr, "cuda_sam3d: slat_dit active voxels=%d (gpu argwhere occ>0), steps=%d\n",
                active_voxels, steps);
    }
    ctx->profile.active_voxels = active_voxels;
    ctx->profile.slat_steps = steps;
    if (active_voxels <= 0) {
        fprintf(stderr, "cuda_sam3d: slat_dit occupancy is fully negative\n");
        free(active_coords);
        if (active_d_coords) cuMemFree(active_d_coords);
        return CUDA_SAM3D_E_LOAD;
    }

