lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    int32_t *out_coords = NULL;
    float   *out_feats  = NULL;
    int      out_n      = 0;
    cs3d_slat_clear_coord_cache(ctx);
    cs3d_slat_clear_feat_cache(ctx);
    int slat_rc = cs3d_slat_dit_run_ode_device(ctx, active_d_coords,
                                               active_voxels, cond->data,
                                               cond->n, steps, ctx->cfg.seed,
                                               &out_coords, &out_feats,
                                               &out_n);
    free(active_coords);
    if (slat_rc != 0) {
        if (active_d_coords) cuMemFree(active_d_coords);
        free(out_coords); free(out_feats);
        fprintf(stderr, "cuda_sam3d: slat_dit ODE failed rc=%d active_voxels=%d\n",
                slat_rc, active_voxels);
        return CUDA_SAM3D_E_LOAD;
    }
    int out_c = sam3d_cpu_slat_dit_out_channels(ctx->cpu_slat_dit);
    CUdeviceptr adopt_d_coords = (out_n == active_voxels)
                                ? ctx->gpu_slat_ode_ws.d_cur_coords : 0;
    CUdeviceptr adopt_d_feats = (out_c == 8 && out_n == active_voxels)
                              ? ctx->gpu_slat_ode_ws.d_cur_feats : 0;
    rc = cs3d_adopt_slat_device(ctx, out_coords, out_feats, out_n, out_c,
                                adopt_d_coords, adopt_d_feats,
                                adopt_d_feats ? 1 : 0);
    if (active_d_coords) cuMemFree(active_d_coords);
    ctx->profile.slat_dit_ms = cs3d_time_ms() - t0;
    return rc;
}

int cuda_sam3d_debug_slat_dit_forward(cuda_sam3d_ctx *ctx,
                                      const int32_t *coords,
                                      const float *feats, int N,
                                      float t,
                                      const float *cond, int n_cond,
                                      float *out_feats)
{
    if (!ctx || !coords || !feats || N <= 0 || !cond || n_cond <= 0 || !out_feats)
        return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    cs3d_slat_clear_coord_cache(ctx);
    cs3d_slat_clear_feat_cache(ctx);
#if defined(_OPENMP)
    int nthr = omp_get_max_threads(); if (nthr < 1) nthr = 1;
#else
    int nthr = 1;
#endif
    sam3d_cpu_slat_dit_set_input_layer_hook(cs3d_slat_input_layer_gpu_hook, ctx);
    sam3d_cpu_slat_dit_set_io_block_hook(cs3d_slat_io_block_gpu_hook, ctx);
    sam3d_cpu_slat_dit_set_final_layer_hook(cs3d_slat_final_layer_gpu_hook, ctx);
    sam3d_cpu_slat_dit_set_ape_transformer_hook(cs3d_slat_ape_transformer_gpu_hook, ctx);
    sam3d_cpu_slat_dit_set_transformer_hook(cs3d_slat_transformer_gpu_hook, ctx);
    float *out = sam3d_cpu_slat_dit_forward(ctx->cpu_slat_dit,
                                            coords, feats, N, t,
                                            cond, n_cond, nthr);
    sam3d_cpu_slat_dit_set_transformer_hook(NULL, NULL);
    sam3d_cpu_slat_dit_set_ape_transformer_hook(NULL, NULL);
    sam3d_cpu_slat_dit_set_final_layer_hook(NULL, NULL);
    sam3d_cpu_slat_dit_set_io_block_hook(NULL, NULL);
    sam3d_cpu_slat_dit_set_input_layer_hook(NULL, NULL);
    if (!out) return CUDA_SAM3D_E_LOAD;
    int out_c = sam3d_cpu_slat_dit_out_channels(ctx->cpu_slat_dit);
    memcpy(out_feats, out, (size_t)N * out_c * sizeof(float));
    free(out);
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_slat_dit_info(cuda_sam3d_ctx *ctx,
                             int *out_in_channels, int *out_out_channels,
                             int *out_cond_channels)
{
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    if (out_in_channels)   *out_in_channels   = sam3d_cpu_slat_dit_in_channels  (ctx->cpu_slat_dit);
    if (out_out_channels)  *out_out_channels  = sam3d_cpu_slat_dit_out_channels (ctx->cpu_slat_dit);
    if (out_cond_channels) *out_cond_channels = sam3d_cpu_slat_dit_cond_channels(ctx->cpu_slat_dit);
    return CUDA_SAM3D_E_OK;
}

/* Active SLAT source: prefer override (verify_slat_gs injects ref data). */
static const cs3d_host_slat *cs3d_active_slat(const cuda_sam3d_ctx *ctx)
{
    return ctx->ovr_slat.feats ? &ctx->ovr_slat : &ctx->slat_tokens;
}

static int cs3d_ensure_gs(cuda_sam3d_ctx *ctx) {
    if (ctx->cpu_gs) return CUDA_SAM3D_E_OK;
    ctx->cpu_gs = sam3d_cpu_gs_decoder_load(ctx->safetensors_dir_resolved);
    if (!ctx->cpu_gs) {
        fprintf(stderr, "cuda_sam3d: gs_decoder load failed (dir=%s)\n",
                ctx->safetensors_dir_resolved);
        return CUDA_SAM3D_E_LOAD;
    }
    return CUDA_SAM3D_E_OK;
}

static int cs3d_ensure_gs_head_gpu(cuda_sam3d_ctx *ctx)
{
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    if (ctx->gpu_gs_head.loaded) return CUDA_SAM3D_E_OK;
    sam3d_gs_decoder_model *m =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    if (!m) return CUDA_SAM3D_E_LOAD;
    size_t total = 0;
    if (cs3d_slat_io_upload_qtensor(&m->input_w, "gs.input_layer.weight",
                                    &ctx->gpu_gs_head.input_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->input_b, "gs.input_layer.bias",
                                    &ctx->gpu_gs_head.input_b, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_w, "gs.out_layer.weight",
                                    &ctx->gpu_gs_head.out_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_b, "gs.out_layer.bias",
                                    &ctx->gpu_gs_head.out_b, &total) != 0) {
        goto fail;
    }
    ctx->gpu_gs_head.mlp_blocks = (cs3d_gs_mlp_block_gpu *)calloc(
        (size_t)m->n_blocks, sizeof(ctx->gpu_gs_head.mlp_blocks[0]));
    if (!ctx->gpu_gs_head.mlp_blocks) goto fail;
    ctx->gpu_gs_head.n_mlp_blocks = m->n_blocks;
    ctx->gpu_gs_head.mlp_dim = m->dim;
    ctx->gpu_gs_head.mlp_hidden = (int)(m->dim * m->mlp_ratio + 0.5f);
    for (int b = 0; b < m->n_blocks; b++) {
        char name[128];
        const sam3d_gs_block *blk = &m->blocks[b];
        cs3d_gs_mlp_block_gpu *gb = &ctx->gpu_gs_head.mlp_blocks[b];
        snprintf(name, sizeof(name), "gs.blocks.%d.attn_qkv.weight", b);
        if (cs3d_slat_io_upload_qtensor(&blk->attn_qkv_w, name, &gb->qkv_w, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.attn_qkv.bias", b);
        if (cs3d_slat_io_upload_qtensor(&blk->attn_qkv_b, name, &gb->qkv_b, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.attn_out.weight", b);
        if (cs3d_slat_io_upload_qtensor(&blk->attn_out_w, name, &gb->out_w, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.attn_out.bias", b);
        if (cs3d_slat_io_upload_qtensor(&blk->attn_out_b, name, &gb->out_b, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.mlp_fc1.weight", b);
        if (cs3d_slat_io_upload_qtensor(&blk->mlp_fc1_w, name, &gb->fc1_w, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.mlp_fc1.bias", b);
        if (cs3d_slat_io_upload_qtensor(&blk->mlp_fc1_b, name, &gb->fc1_b, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.mlp_fc2.weight", b);
        if (cs3d_slat_io_upload_qtensor(&blk->mlp_fc2_w, name, &gb->fc2_w, &total) != 0)
            goto fail;
        snprintf(name, sizeof(name), "gs.blocks.%d.mlp_fc2.bias", b);
        if (cs3d_slat_io_upload_qtensor(&blk->mlp_fc2_b, name, &gb->fc2_b, &total) != 0)
            goto fail;
    }
    ctx->gpu_gs_head.input_in = m->input_w.n_cols;
    ctx->gpu_gs_head.input_out = m->input_w.n_rows;
    ctx->gpu_gs_head.out_in = m->out_w.n_cols;
    ctx->gpu_gs_head.out_out = m->out_w.n_rows;
    ctx->gpu_gs_head.total_bytes = total;
    ctx->gpu_gs_head.loaded = 1;
    return CUDA_SAM3D_E_OK;

