lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    size_t mlp_bytes = (size_t)N * hidden * sizeof(float);
    int n_h = N * dim;
    int n_mlp = N * hidden;
    int rc = -1;
    if (cs3d_ensure_devbuf(&ws->d_h,   &ws->cap_h,   h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_ln,  &ws->cap_ln,  h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_out, &ws->cap_out, h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_mlp, &ws->cap_mlp, mlp_bytes) != 0)
        goto done;
    if (cuMemcpyHtoD(ws->d_h, h, h_bytes) != CUDA_SUCCESS)
        goto done;

    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln[] = { &ws->d_ln, &ws->d_h, &gb->fc2_w, &gb->fc2_b,
                     &N, &dim, &eps, &affine };
    if (cuLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != CUDA_SUCCESS)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (hidden + 15) / 16;
      void *a[] = { &ws->d_mlp, &ws->d_ln, &gb->fc1_w, &gb->fc1_b,
                    &N, &dim, &hidden };
      if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }
    { void *a[] = { &ws->d_mlp, &n_mlp };
      if (cuLaunchKernel(gelu, (n_mlp + 255) / 256, 1, 1,
                         256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }
    { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
      void *a[] = { &ws->d_out, &ws->d_mlp, &gb->fc2_w, &gb->fc2_b,
                    &N, &hidden, &dim };
      if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }
    { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
      if (cuLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                         256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
          goto done; }
    if (cuMemcpyDtoH(h, ws->d_h, h_bytes) != CUDA_SUCCESS)
        goto done;
    rc = 0;

done:
    return rc;
}

static int cs3d_gs_win_kv_cmp(const void *a, const void *b)
{
    int64_t ka = ((const cs3d_gs_win_kv *)a)->key;
    int64_t kb = ((const cs3d_gs_win_kv *)b)->key;
    return (ka < kb) ? -1 : (ka > kb);
}

static int cs3d_gs_build_partition(const sp3d_tensor *x, int window_size,
                                   const int shift[3], int **fwd_out,
                                   cs3d_gs_win_run **runs_out,
                                   int *n_runs_out, int *max_len_out)
{
    if (!x || x->N <= 0 || !fwd_out || !runs_out || !n_runs_out || !max_len_out)
        return -1;
    int N = x->N;
    int32_t mx[3] = {0, 0, 0};
    for (int i = 0; i < N; i++) {
        for (int a = 0; a < 3; a++) {
            int32_t v = x->coords[i * 4 + 1 + a] + shift[a];
            if (v > mx[a]) mx[a] = v;
        }
    }
    int nw[3];
    for (int a = 0; a < 3; a++) nw[a] = (int)(mx[a] / window_size) + 1;
    int64_t off[3];
    off[2] = 1;
    off[1] = (int64_t)nw[2];
    off[0] = (int64_t)nw[1] * nw[2];
    int64_t per_batch = (int64_t)nw[0] * nw[1] * nw[2];

    cs3d_gs_win_kv *kv = (cs3d_gs_win_kv *)malloc((size_t)N * sizeof(*kv));
    int *fwd = (int *)malloc((size_t)N * sizeof(int));
    cs3d_gs_win_run *runs = (cs3d_gs_win_run *)malloc((size_t)N * sizeof(*runs));
    if (!kv || !fwd || !runs) {
        free(kv); free(fwd); free(runs);
        return -1;
    }
    for (int i = 0; i < N; i++) {
        int32_t b = x->coords[i * 4];
        int64_t key = (int64_t)b * per_batch;
        for (int a = 0; a < 3; a++) {
            int32_t v = (x->coords[i * 4 + 1 + a] + shift[a]) / window_size;
            key += (int64_t)v * off[a];
        }
        kv[i].key = key;
        kv[i].idx = i;
    }
    qsort(kv, (size_t)N, sizeof(*kv), cs3d_gs_win_kv_cmp);
    for (int i = 0; i < N; i++) fwd[i] = kv[i].idx;
    int nr = 0, max_len = 0;
    for (int i = 0; i < N;) {
        int j = i + 1;
        while (j < N && kv[j].key == kv[i].key) j++;
        runs[nr].start = i;
        runs[nr].len = j - i;
        if (runs[nr].len > max_len) max_len = runs[nr].len;
        nr++;
        i = j;
    }
    free(kv);
    *fwd_out = fwd;
    *runs_out = runs;
    *n_runs_out = nr;
    *max_len_out = max_len;
    return 0;
}

static int cs3d_gs_window_attn_gpu_hook(void *user,
                                        float *out,
                                        const float *qkv,
                                        const void *x_void,
                                        int window_size,
                                        const int shift[3],
                                        int n_heads,
                                        int head_dim)
{
    cuda_sam3d_ctx *ctx = (cuda_sam3d_ctx *)user;
    const sp3d_tensor *x = (const sp3d_tensor *)x_void;
    if (!ctx || !out || !qkv || !x || x->N <= 0 || !x->coords ||
        window_size <= 0 || !shift || n_heads <= 0 || head_dim <= 0)
        return -1;
    hipFunction_t gather = NULL, scatter = NULL, sdpa = NULL;
    if (cuModuleGetFunction(&gather, ctx->mod, "sam3d_gs_gather_qkv_window_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&scatter, ctx->mod, "sam3d_gs_scatter_window_f32") != CUDA_SUCCESS ||
        cuModuleGetFunction(&sdpa, ctx->mod, "sdpa_f32") != CUDA_SUCCESS)
        return -1;

    int *fwd = NULL;
    cs3d_gs_win_run *runs = NULL;
    int n_runs = 0, max_len = 0;
    if (cs3d_gs_build_partition(x, window_size, shift, &fwd, &runs,
                                &n_runs, &max_len) != 0)
        return -1;

    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    int N = x->N;
    int dim = n_heads * head_dim;
    size_t qkv_bytes = (size_t)N * 3 * dim * sizeof(float);
    size_t out_bytes = (size_t)N * dim * sizeof(float);
    size_t fwd_bytes = (size_t)N * sizeof(int);
    size_t win_bytes = (size_t)max_len * dim * sizeof(float);
    float scale = 1.0f / sqrtf((float)head_dim);
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_qkv,  &ws->cap_qkv,  qkv_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_fwd,  &ws->cap_fwd,  fwd_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_attn, &ws->cap_attn, out_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_q,    &ws->cap_q,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_k,    &ws->cap_k,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_v,    &ws->cap_v,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_win,  &ws->cap_win,  win_bytes) != 0)
        goto done;
    if (cuMemcpyHtoD(ws->d_qkv, qkv, qkv_bytes) != CUDA_SUCCESS ||
        cuMemcpyHtoD(ws->d_fwd, fwd, fwd_bytes) != CUDA_SUCCESS)
        goto done;

    for (int r = 0; r < n_runs; r++) {
        int start = runs[r].start;
        int len = runs[r].len;
        int elems = len * dim;
        void *a_g[] = { &ws->d_q, &ws->d_k, &ws->d_v, &ws->d_qkv,
                        &ws->d_fwd, &start, &len, &dim };
        if (cuLaunchKernel(gather, (elems + 255) / 256, 1, 1,
                           256, 1, 1, 0, 0, a_g, NULL) != CUDA_SUCCESS)
            goto done;
        size_t smem = (size_t)(256 + len) * sizeof(float);
        void *a_s[] = { &ws->d_win, &ws->d_q, &ws->d_k, &ws->d_v,
                        &len, &len, &n_heads, &head_dim, &scale };
        if (cuLaunchKernel(sdpa, len, n_heads, 1,
                           256, 1, 1, (unsigned)smem, 0, a_s, NULL) != CUDA_SUCCESS)
            goto done;
        void *a_sc[] = { &ws->d_attn, &ws->d_win, &ws->d_fwd,
                         &start, &len, &dim };
        if (cuLaunchKernel(scatter, (elems + 255) / 256, 1, 1,
                           256, 1, 1, 0, 0, a_sc, NULL) != CUDA_SUCCESS)
            goto done;
    }
    if (cuMemcpyDtoH(out, ws->d_attn, out_bytes) != CUDA_SUCCESS)
        goto done;
    rc = 0;

done:
    free(fwd);
    free(runs);
    return rc;
}

