lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    size_t qkv_bytes = (size_t)N * 3 * dim * sizeof(float);
    size_t mlp_bytes = (size_t)N * hidden * sizeof(float);
    size_t fwd_bytes = (size_t)N * sizeof(int);
    int n_h = N * dim;
    int n_mlp = N * hidden;
    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_h,    &ws->cap_h,    h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_ln,   &ws->cap_ln,   h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_qkv,  &ws->cap_qkv,  qkv_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_fwd,  &ws->cap_fwd,  fwd_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_attn, &ws->cap_attn, h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_out,  &ws->cap_out,  h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_mlp,  &ws->cap_mlp,  mlp_bytes) != 0)
        goto done;
    if (cuMemcpyHtoD(ws->d_h, h, h_bytes) != CUDA_SUCCESS)
        goto done;

    for (int bi = 0; bi < n_blocks; bi++) {
        cs3d_gs_mlp_block_gpu *gb = &ctx->gpu_gs_head.mlp_blocks[bi];
        int shift_v = (bi & 1) ? (window_size / 2) : 0;
        int shift[3] = {shift_v, shift_v, shift_v};
        int *fwd = NULL;
        cs3d_gs_win_run *runs = NULL;
        int n_runs = 0, max_len = 0;
        if (cs3d_gs_build_partition(x, window_size, shift, &fwd, &runs,
                                    &n_runs, &max_len) != 0)
            goto done;

        size_t win_bytes = (size_t)max_len * dim * sizeof(float);
        float scale = 1.0f / sqrtf((float)head_dim);
        if (cs3d_ensure_devbuf(&ws->d_q,   &ws->cap_q,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_k,   &ws->cap_k,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_v,   &ws->cap_v,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_win, &ws->cap_win, win_bytes) != 0 ||
            cuMemcpyHtoD(ws->d_fwd, fwd, fwd_bytes) != CUDA_SUCCESS) {
            free(fwd);
            free(runs);
            goto done;
        }

        void *a_ln1[] = { &ws->d_ln, &ws->d_h, &gb->out_w, &gb->out_b,
                          &N, &dim, &eps, &affine };
        if (cuLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                           (unsigned)ln_smem, 0, a_ln1, NULL) != CUDA_SUCCESS) {
            free(fwd); free(runs); goto done;
        }
        { int qkv_dim = 3 * dim;
          unsigned gx = (N + 15) / 16, gy = (qkv_dim + 15) / 16;
          void *a[] = { &ws->d_qkv, &ws->d_ln, &gb->qkv_w, &gb->qkv_b,
                        &N, &dim, &qkv_dim };
          if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS) {
              free(fwd); free(runs); goto done;
          } }

        for (int r = 0; r < n_runs; r++) {
            int start = runs[r].start;
            int len = runs[r].len;
            int elems = len * dim;
            void *a_g[] = { &ws->d_q, &ws->d_k, &ws->d_v, &ws->d_qkv,
                            &ws->d_fwd, &start, &len, &dim };
            if (cuLaunchKernel(gather, (elems + 255) / 256, 1, 1,
                               256, 1, 1, 0, 0, a_g, NULL) != CUDA_SUCCESS) {
                free(fwd); free(runs); goto done;
            }
            size_t smem = (size_t)(256 + len) * sizeof(float);
            void *a_s[] = { &ws->d_win, &ws->d_q, &ws->d_k, &ws->d_v,
                            &len, &len, &n_heads, &head_dim, &scale };
            if (cuLaunchKernel(sdpa, len, n_heads, 1,
                               256, 1, 1, (unsigned)smem, 0, a_s, NULL) != CUDA_SUCCESS) {
                free(fwd); free(runs); goto done;
            }
            void *a_sc[] = { &ws->d_attn, &ws->d_win, &ws->d_fwd,
                             &start, &len, &dim };
            if (cuLaunchKernel(scatter, (elems + 255) / 256, 1, 1,
                               256, 1, 1, 0, 0, a_sc, NULL) != CUDA_SUCCESS) {
                free(fwd); free(runs); goto done;
            }
        }
        free(fwd);
        free(runs);

        { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
          void *a[] = { &ws->d_out, &ws->d_attn, &gb->out_w, &gb->out_b,
                        &N, &dim, &dim };
          if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }
        { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
          if (cuLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }

        void *a_ln2[] = { &ws->d_ln, &ws->d_h, &gb->fc2_w, &gb->fc2_b,
                          &N, &dim, &eps, &affine };
        if (cuLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                           (unsigned)ln_smem, 0, a_ln2, NULL) != CUDA_SUCCESS)
            goto done;
        { unsigned gx = (N + 15) / 16, gy = (hidden + 15) / 16;
          void *a[] = { &ws->d_mlp, &ws->d_ln, &gb->fc1_w, &gb->fc1_b,
                        &N, &dim, &hidden };
          if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }
        { void *a[] = { &ws->d_mlp, &n_mlp };
          if (cuLaunchKernel(gelu, (n_mlp + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }
        { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
          void *a[] = { &ws->d_out, &ws->d_mlp, &gb->fc2_w, &gb->fc2_b,
                        &N, &hidden, &dim };
          if (cuLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }
        { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
          if (cuLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != CUDA_SUCCESS)
              goto done; }
    }

    if (cuMemcpyDtoH(h, ws->d_h, h_bytes) != CUDA_SUCCESS)
        goto done;
    rc = 0;

done:
    return rc;
}

static int cs3d_gs_transformer_gpu_forward(cuda_sam3d_ctx *ctx,
                                           const sp3d_tensor *x,
                                           const sam3d_gs_decoder_model *m,
                                           CUdeviceptr src_d_coords,
                                           CUdeviceptr src_d_feats,
                                           float **out_feats)
{
    if (!ctx || !x || !x->coords || !x->feats || !m || x->N <= 0 || x->C <= 0)
        return -1;
    if (cs3d_ensure_gs_head_gpu(ctx) != CUDA_SAM3D_E_OK) return -1;
    sam3d_gs_decoder_model *ctx_m =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    if (m != ctx_m) return -1;

