lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
int cuda_sam3d_debug_slat_gs_transformer(cuda_sam3d_ctx *ctx,
                                         const int32_t *coords,
                                         const float *feats, int N,
                                         float **out_feats, int *out_c)
{
    if (!ctx || !coords || !feats || N <= 0 || !out_feats) return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
#if defined(_OPENMP)
    int nthr = omp_get_max_threads(); if (nthr < 1) nthr = 1;
#else
    int nthr = 1;
#endif
    sam3d_cpu_gs_decoder_set_input_ape_hook(cs3d_gs_input_ape_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_final_layer_hook(cs3d_gs_final_layer_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_window_attn_hook(cs3d_gs_window_attn_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_attn_block_hook(cs3d_gs_attn_block_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_mlp_hook(cs3d_gs_mlp_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_block_hook(cs3d_gs_block_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_stack_hook(cs3d_gs_stack_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_transformer_hook(cs3d_gs_transformer_gpu_hook, ctx);
    float *out = sam3d_cpu_gs_decoder_transformer(ctx->cpu_gs, coords, feats,
                                                  N, nthr);
    sam3d_cpu_gs_decoder_set_transformer_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_stack_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_block_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_mlp_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_attn_block_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_window_attn_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_final_layer_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_input_ape_hook(NULL, NULL);
    if (!out) return CUDA_SAM3D_E_LOAD;
    *out_feats = out;
    if (out_c) *out_c = sam3d_cpu_gs_decoder_out_channels(ctx->cpu_gs);
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_debug_slat_gs_to_representation(cuda_sam3d_ctx *ctx,
                                               const int32_t *coords,
                                               const float *feats_out, int N,
                                               float *xyz_out, float *dc_out,
                                               float *scaling_out, float *rotation_out,
                                               float *opacity_out)
{
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    return sam3d_cpu_gs_decoder_to_representation(ctx->cpu_gs, coords, feats_out, N,
                                                  xyz_out, dc_out,
                                                  scaling_out, rotation_out,
                                                  opacity_out) == 0
           ? CUDA_SAM3D_E_OK : CUDA_SAM3D_E_LOAD;
}

int cuda_sam3d_slat_gs_info(cuda_sam3d_ctx *ctx,
                            int *out_in_channels, int *out_out_channels,
                            int *out_num_gaussians)
{
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    if (out_in_channels)   *out_in_channels   = sam3d_cpu_gs_decoder_in_channels  (ctx->cpu_gs);
    if (out_out_channels)  *out_out_channels  = sam3d_cpu_gs_decoder_out_channels (ctx->cpu_gs);
    if (out_num_gaussians) *out_num_gaussians = sam3d_cpu_gs_decoder_num_gaussians(ctx->cpu_gs);
    return CUDA_SAM3D_E_OK;
}

static int cs3d_gs_pack_ply_gpu_device(cuda_sam3d_ctx *ctx,
                                       const sam3d_gs_decoder_model *m,
                                       CUdeviceptr d_coords,
                                       CUdeviceptr d_feats,
                                       int N,
                                       float **out_ply,
                                       int *out_total)
{
    if (!ctx || !m || !d_coords || !d_feats || N <= 0 || !out_ply || !out_total)
        return CUDA_SAM3D_E_INVAL;
    hipFunction_t fn = NULL;
    if (cuModuleGetFunction(&fn, ctx->mod, "sam3d_gs_pack_ply_f32") != CUDA_SUCCESS) {
        fprintf(stderr, "cuda_sam3d: missing sam3d_gs_pack_ply_f32\n");
        return CUDA_SAM3D_E_LOAD;
    }

    int C = m->out_channels;
    int G = m->num_gaussians;
    int stride = CUDA_SAM3D_GS_STRIDE;
    int total = N * G;
    size_t ply_bytes = (size_t)total * stride * sizeof(float);
    CUdeviceptr d_ply = 0, d_perturb = 0;
    float *ply = NULL;
    int rc = CUDA_SAM3D_E_LOAD;

    if (cuMemAlloc(&d_ply, ply_bytes) != CUDA_SUCCESS)
        goto done;

    int has_perturb = (m->perturb_offset && m->offset_perturbation.data) ? 1 : 0;
    if (has_perturb &&
        cs3d_slat_io_upload_qtensor(&m->offset_perturbation,
                                    "gs.offset_perturbation",
                                    &d_perturb, NULL) != 0)
        goto done;

    int resolution = m->resolution;
    float voxel_size = m->voxel_size;
    float scaling_bias = m->scaling_bias;
    float opacity_bias = m->opacity_bias;
    int r_xyz0 = m->r_xyz[0];
    int r_dc0 = m->r_features_dc[0];
    int r_scl0 = m->r_scaling[0];
    int r_rot0 = m->r_rotation[0];
    int r_op0 = m->r_opacity[0];
    float lr_xyz = m->lr_xyz;
    float lr_features_dc = m->lr_features_dc;
    float lr_scaling = m->lr_scaling;
    float lr_rotation = m->lr_rotation;
    float lr_opacity = m->lr_opacity;
    void *args[] = { &d_ply, &d_coords, &d_feats, &d_perturb, &has_perturb,
                     &N, &C, &G, &stride, &resolution,
                     &voxel_size, &scaling_bias, &opacity_bias,
                     &r_xyz0, &r_dc0, &r_scl0, &r_rot0, &r_op0,
                     &lr_xyz, &lr_features_dc, &lr_scaling,
                     &lr_rotation, &lr_opacity };
    if (cuLaunchKernel(fn, (total + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, args, NULL) != CUDA_SUCCESS)
        goto done;
    ply = (float *)malloc(ply_bytes);
    if (!ply) goto done;
    if (cuMemcpyDtoH(ply, d_ply, ply_bytes) != CUDA_SUCCESS)
        goto done;
    *out_ply = ply;
    *out_total = total;
    ply = NULL;
    rc = CUDA_SAM3D_E_OK;

done:
    free(ply);
    if (d_ply) cuMemFree(d_ply);
    if (d_perturb) cuMemFree(d_perturb);
    return rc;
}

static int cs3d_gs_pack_ply_gpu(cuda_sam3d_ctx *ctx,
                                const sam3d_gs_decoder_model *m,
                                const int32_t *coords,
                                const float *feats_out,
                                int N,
                                float **out_ply,
                                int *out_total)
{
    if (!ctx || !m || !coords || !feats_out || N <= 0 || !out_ply || !out_total)
        return CUDA_SAM3D_E_INVAL;

    int C = m->out_channels;
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t feat_bytes = (size_t)N * C * sizeof(float);
    CUdeviceptr d_coords = cu_upload_raw(coords, coord_bytes);
    CUdeviceptr d_feats = cu_upload_raw(feats_out, feat_bytes);
    if (!d_coords || !d_feats) {
        if (d_coords) cuMemFree(d_coords);
        if (d_feats) cuMemFree(d_feats);
        return CUDA_SAM3D_E_LOAD;
    }

    int rc = cs3d_gs_pack_ply_gpu_device(ctx, m, d_coords, d_feats, N,
                                         out_ply, out_total);
    cuMemFree(d_coords);
    cuMemFree(d_feats);
    return rc;
}

int cuda_sam3d_debug_slat_gs_pack_ply(cuda_sam3d_ctx *ctx,
                                      const int32_t *coords,
                                      const float *feats_out, int N,
                                      float **out_ply, int *out_total)
{
    if (!ctx || !coords || !feats_out || N <= 0 || !out_ply || !out_total)
        return CUDA_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;
    sam3d_gs_decoder_model *gm =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    return cs3d_gs_pack_ply_gpu(ctx, gm, coords, feats_out, N,
                                out_ply, out_total);
}

int cuda_sam3d_run_slat_gs_decode(cuda_sam3d_ctx *ctx) {
    double t0 = cs3d_time_ms();
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_slat *slat = cs3d_active_slat(ctx);
    if (!slat->feats || !slat->coords) {
        fprintf(stderr, "cuda_sam3d: slat_gs_decode needs SLAT tokens — "
                        "run slat_dit (or override) first\n");
        return CUDA_SAM3D_E_NO_INPUT;
    }
    int rc = cs3d_ensure_gs(ctx);
    if (rc != CUDA_SAM3D_E_OK) return rc;

    int N = slat->n;
    int G = sam3d_cpu_gs_decoder_num_gaussians(ctx->cpu_gs);
    int total = N * G;

    sam3d_gs_decoder_model *gm =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    sp3d_tensor x = {0};
    x.coords = (int32_t *)slat->coords;
    x.feats = (float *)slat->feats;
    x.N = N;
    x.C = slat->c;
    x.batch_size = 1;

    CUdeviceptr src_d_coords = 0;
    CUdeviceptr src_d_feats = 0;
    if (slat == &ctx->slat_tokens &&
        ctx->d_slat_coords && ctx->d_slat_feats &&
        ctx->slat_tokens.n == N && ctx->slat_tokens.c == slat->c) {
        src_d_coords = ctx->d_slat_coords;
        src_d_feats = ctx->d_slat_feats;
    }
    if (cs3d_gs_transformer_gpu_forward(ctx, &x, gm,
                                        src_d_coords, src_d_feats,
                                        NULL) != 0)
        return CUDA_SAM3D_E_LOAD;

    float *ply = NULL;
    int packed_total = 0;
    rc = cs3d_gs_pack_ply_gpu_device(ctx, gm,
                                     ctx->gpu_gs_head_ws.d_coords,
                                     ctx->gpu_gs_head_ws.d_out,
                                     N, &ply, &packed_total);
    if (rc != CUDA_SAM3D_E_OK) {
        free(ply);
        return rc;
    }
    if (packed_total != total) {
        free(ply);
        return CUDA_SAM3D_E_LOAD;
    }
    rc = cs3d_adopt_gaussians(ctx, ply, packed_total);
    ctx->profile.slat_gs_ms = cs3d_time_ms() - t0;
    if (rc == CUDA_SAM3D_E_OK) ctx->profile.gaussians = packed_total;
    return rc;
}

/* ===== read-back stubs ===== */

