lighttransport/gemm/cuda/sam3d/cuda_sam3d_runner.c
int cuda_sam3d_get_dinov2_tokens(cuda_sam3d_ctx *ctx, float *out,
                                 int *out_n, int *out_c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_2d *src = cs3d_active_dinov2(ctx);
    if (!src->data) return CUDA_SAM3D_E_NO_INPUT;
    if (out_n) *out_n = src->n;
    if (out_c) *out_c = src->c;
    if (out) memcpy(out, src->data, (size_t)src->n * src->c * sizeof(float));
    return CUDA_SAM3D_E_OK;
}
int cuda_sam3d_get_cond_tokens(cuda_sam3d_ctx *ctx, float *out,
                               int *out_n, int *out_c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_2d *src = cs3d_active_cond(ctx);
    if (!src->data) return CUDA_SAM3D_E_NO_INPUT;
    if (out_n) *out_n = src->n;
    if (out_c) *out_c = src->c;
    if (out) memcpy(out, src->data, (size_t)src->n * src->c * sizeof(float));
    return CUDA_SAM3D_E_OK;
}
int cuda_sam3d_get_ss_latent(cuda_sam3d_ctx *ctx, float *out, int *out_dims) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_nd *src = cs3d_active_ss_latent(ctx);
    if (!src->data) return CUDA_SAM3D_E_NO_INPUT;
    size_t numel = 1;
    for (int i = 0; i < src->ndim; i++) numel *= (size_t)src->dims[i];
    if (out_dims) for (int i = 0; i < src->ndim; i++) out_dims[i] = src->dims[i];
    if (out) memcpy(out, src->data, numel * sizeof(float));
    return CUDA_SAM3D_E_OK;
}
int cuda_sam3d_get_occupancy(cuda_sam3d_ctx *ctx, float *out, int *out_dims) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_nd *src = cs3d_active_occupancy(ctx);
    if (!src->data) return CUDA_SAM3D_E_NO_INPUT;
    size_t numel = 1;
    for (int i = 0; i < src->ndim; i++) numel *= (size_t)src->dims[i];
    if (out_dims) for (int i = 0; i < src->ndim; i++) out_dims[i] = src->dims[i];
    if (out) memcpy(out, src->data, numel * sizeof(float));
    return CUDA_SAM3D_E_OK;
}
int cuda_sam3d_get_slat_tokens(cuda_sam3d_ctx *ctx, float *out_feats,
                               int32_t *out_coords, int *out_n, int *out_c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    const cs3d_host_slat *src = ctx->ovr_slat.feats
                              ? &ctx->ovr_slat
                              : &ctx->slat_tokens;
    if (!src->feats) return CUDA_SAM3D_E_NO_INPUT;
    if (out_n) *out_n = src->n;
    if (out_c) *out_c = src->c;
    if (out_feats)
        memcpy(out_feats, src->feats, (size_t)src->n * src->c * sizeof(float));
    if (out_coords)
        memcpy(out_coords, src->coords, (size_t)src->n * 4 * sizeof(int32_t));
    return CUDA_SAM3D_E_OK;
}
int cuda_sam3d_get_gaussians(cuda_sam3d_ctx *ctx, float *out, int *out_n) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    if (!ctx->gaussians.data) return CUDA_SAM3D_E_NO_INPUT;
    if (out_n) *out_n = ctx->gaussians.n;
    if (out)
        memcpy(out, ctx->gaussians.data,
               (size_t)ctx->gaussians.n * CUDA_SAM3D_GS_STRIDE * sizeof(float));
    return CUDA_SAM3D_E_OK;
}

/* ===== debug overrides — host-side store, consumed when the
 * downstream stage's kernel is wired up. ===== */

static int cs3d_set_2d(cs3d_host_2d *dst, const float *src, int n, int c) {
    cs3d_free_2d(dst);
    if (!src || n <= 0 || c <= 0) return CUDA_SAM3D_E_INVAL;
    size_t bytes = (size_t)n * c * sizeof(float);
    dst->data = (float *)malloc(bytes);
    if (!dst->data) return CUDA_SAM3D_E_LOAD;
    memcpy(dst->data, src, bytes);
    dst->n = n; dst->c = c;
    return CUDA_SAM3D_E_OK;
}

static int cs3d_set_nd(cs3d_host_nd *dst, const float *src,
                        const int *dims, int ndim) {
    cs3d_free_nd(dst);
    if (!src || !dims || ndim <= 0 || ndim > 4) return CUDA_SAM3D_E_INVAL;
    size_t numel = 1;
    for (int i = 0; i < ndim; i++) {
        if (dims[i] <= 0) return CUDA_SAM3D_E_INVAL;
        numel *= (size_t)dims[i];
        dst->dims[i] = dims[i];
    }
    dst->ndim = ndim;
    dst->data = (float *)malloc(numel * sizeof(float));
    if (!dst->data) return CUDA_SAM3D_E_LOAD;
    memcpy(dst->data, src, numel * sizeof(float));
    return CUDA_SAM3D_E_OK;
}

int cuda_sam3d_debug_override_dinov2(cuda_sam3d_ctx *ctx, const float *tokens,
                                     int n, int c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    return cs3d_set_2d(&ctx->ovr_dinov2, tokens, n, c);
}
int cuda_sam3d_debug_override_cond(cuda_sam3d_ctx *ctx, const float *tokens,
                                   int n, int c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    return cs3d_set_2d(&ctx->ovr_cond, tokens, n, c);
}
int cuda_sam3d_debug_override_ss_latent(cuda_sam3d_ctx *ctx, const float *latent,
                                        const int *dims) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    return cs3d_set_nd(&ctx->ovr_ss_latent, latent, dims, 4);
}
int cuda_sam3d_debug_override_occupancy(cuda_sam3d_ctx *ctx, const float *occ,
                                        const int *dims) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    return cs3d_set_nd(&ctx->ovr_occupancy, occ, dims, 3);
}
int cuda_sam3d_debug_override_slat(cuda_sam3d_ctx *ctx, const float *feats,
                                   const int32_t *coords, int n, int c) {
    if (!ctx) return CUDA_SAM3D_E_INVAL;
    cs3d_free_slat(&ctx->ovr_slat);
    if (!feats || !coords || n <= 0 || c <= 0) return CUDA_SAM3D_E_INVAL;
    size_t f_bytes = (size_t)n * c * sizeof(float);
    size_t k_bytes = (size_t)n * 4 * sizeof(int32_t);
    ctx->ovr_slat.feats  = (float *)malloc(f_bytes);
    ctx->ovr_slat.coords = (int32_t *)malloc(k_bytes);
    if (!ctx->ovr_slat.feats || !ctx->ovr_slat.coords) {
        cs3d_free_slat(&ctx->ovr_slat);
        return CUDA_SAM3D_E_LOAD;
    }
    memcpy(ctx->ovr_slat.feats, feats, f_bytes);
    memcpy(ctx->ovr_slat.coords, coords, k_bytes);
    ctx->ovr_slat.n = n; ctx->ovr_slat.c = c;
    return CUDA_SAM3D_E_OK;
}
